      *================================================================J00001000
       IDENTIFICATION                  DIVISION.                        00002000
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID. FR06CB26.                                            00005000
                                                                        00006000
      *================================================================*00007000
      *                                                                 00008000
      *     AUTOR.....: JOEI LORENTI                                    00009000
      *     ANALISTA..: IVAN SANCHES                                    00009100
      *     EMPRESA...: FOURSYS                                         00009200
      *     DATA......: 28/04/2022                                      00009300
      *                                                                 00009400
      *----------------------------------------------------------------*00009500
      *                                                                 00009600
      *     OBJETIVO: RECEBER NAS VARIAVEIS WRK-DATA -> 26042022,       00009703
      *               WRK-LANCAMENTO -> PAGAMENTO TITULO(X30)           00009803
      *               WRK-VALOR -> 008000(2 DEC)                        00009903
      *               WRK-TIPO -> C                                     00010003
      *               RECEBER OS VALORAS DA SYSIN, MOSTRANDO MENSAGEM:  00020003
      *               WRK-TIPO = 'C' OU 'D' - 'PROCESSAR-ARQUIVO'       00021003
      *               CASO CONTRARIO - 'TRATAR-ERRO'                    00022103
      *               *** USO DA VARIAVEL NIVEL 88  ***                 00072703
      *================================================================*00072804
       ENVIRONMENT                      DIVISION.                       00072904
      *================================================================*00073004
                                                                        00073105
      *----------------------------------------------------------------*00073205
       CONFIGURATION                    SECTION.                        00073305
      *----------------------------------------------------------------*00073405
                                                                        00073505
        SPECIAL-NAMES.                                                  00073605
              DECIMAL-POINT            IS COMMA.                        00073705
                                                                        00073805
      *----------------------------------------------------------------*00073905
                                                                        00074005
      *================================================================J00074108
       DATA                            DIVISION.                        00074205
      *================================================================*00074305
                                                                        00074405
      *----------------------------------------------------------------*00074505
       WORKING-STORAGE                 SECTION.                         00074605
      *----------------------------------------------------------------*00074705
       01 WRK-REGISTRO.                                                 00074805
          05 WRK-DATA                  PIC 9(08)        VALUE ZEROS.    00074905
          05 WRK-LANCAMENTO            PIC X(30)        VALUE SPACES.   00075005
          05 WRK-VALOR                 PIC 9(06)V99     VALUE ZEROS.    00075105
          05 WRK-TIPO                  PIC X(01)        VALUE ZEROS.    00075205
            88 WRK-TIPO-VALIDO                          VALUE 'C' 'D'.  00075307
                                                                        00075405
       77 WRK-MENSAGEM                 PIC X(45)        VALUE SPACES.   00075505
                                                                        00075605
      *================================================================*00075705
       PROCEDURE                       DIVISION.                        00075806
      *================================================================*00075905
                                                                        00076005
      *----------------------------------------------------------------*00076100
       0000-PRINCIPAL                   SECTION.                        00076200
      *----------------------------------------------------------------*00076300
                                                                        00076408
           PERFORM 0100-INICIAR.                                        00076508
               IF WRK-DATA NOT EQUAL ZEROS                              00076608
                  PERFORM 0200-PROCESSAR.                               00076808
                                                                        00076908
           PERFORM 0300-FINALIZAR.                                      00077008
                                                                        00077108
           STOP RUN.                                                    00077208
                                                                        00077308
      *----------------------------------------------------------------*00077408
       0000-99-FIM.                    EXIT.                            00077508
      *----------------------------------------------------------------*00077608
                                                                        00077700
      *----------------------------------------------------------------*00077808
       0100-INICIAR                    SECTION.                         00077908
      *----------------------------------------------------------------*00078008
                                                                        00078108
           ACCEPT WRK-REGISTRO         FROM SYSIN.                      00078200
                                                                        00078308
      *----------------------------------------------------------------*00078408
       0100-99-FIM                     SECTION.                         00078508
      *----------------------------------------------------------------*00078608
      *----------------------------------------------------------------*00078708
       0200-PROCESSAR                  SECTION.                         00078808
      *----------------------------------------------------------------*00078908
                                                                        00079008
               IF WRK-TIPO-VALIDO                                       00079100
                 MOVE 'PROCESSAR-ARQUIVO'                               00079200
                                       TO WRK-MENSAGEM                  00079300
               ELSE                                                     00079400
                 MOVE 'TRATAR-ERRO'                                     00079500
                                       TO WRK-MENSAGEM                  00079600
               END-IF.                                                  00079700
                                                                        00079800
      *----------------------------------------------------------------*00079908
       0200-99-FIM.                    EXIT.                            00080009
      *----------------------------------------------------------------*00080108
                                                                        00080208
      *----------------------------------------------------------------*00080308
       0300-FINALIZAR                  SECTION.                         00080408
      *----------------------------------------------------------------*00080508
                                                                        00080608
             DISPLAY WRK-MENSAGEM.                                      00080700
                                                                        00080808
      *----------------------------------------------------------------*00080908
       0300-99-FIM.                    EXIT.                            00081008
      *----------------------------------------------------------------*00081108
                                                                        00081200
      *----------------------------------------------------------------*00081300
       9000-TRATAR-ERRO                SECTION.                         00081400
      *----------------------------------------------------------------*00081500
      *----------------------------------------------------------------*00081600
       9000-99-FIM.                    EXIT.                            00082000
      *----------------------------------------------------------------*00090000
