      *================================================================*00001002
       IDENTIFICATION                  DIVISION.                        00010000
      *================================================================*00011002
                                                                        00012002
       PROGRAM-ID. FR06CB12.                                            00020001
                                                                        00021002
      *================================================================*00030000
      *     AUTOR   : JOEI LORENTI                                      00040000
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : 22/04/2022                                        00060000
      *                                                                 00070003
      *----------------------------------------------------------------*00070103
      *     OBJETIVO: RECEBER VIA SYSIN TRES NUMEROS NAS VARIAVEIS      00070203
      *               WRK-N1, WRK-N2, WRK-N3,SUBTRAIR  DEVOLVENDO       00071000
      *               EM WRK-RES CONSIDERANDO RESULTADO NEGATIVO.       00071100
      *================================================================*00072000
                                                                        00072102
      *================================================================*00072202
       ENVIRONMENT                      DIVISION.                       00073002
      *================================================================*00074000
                                                                        00074102
      *----------------------------------------------------------------*00074202
       CONFIGURATION                    SECTION.                        00074302
      *----------------------------------------------------------------*00074402
                                                                        00074502
       SPECIAL-NAMES.                                                   00074602
           DECIMAL-POINT                IS COMMA.                       00074705
                                                                        00074802
      *================================================================*00075000
       DATA                             DIVISION.                       00076000
      *================================================================*00077000
                                                                        00077102
      *----------------------------------------------------------------*00078002
       WORKING-STORAGE                  SECTION.                        00079000
      *----------------------------------------------------------------*00080002
                                                                        00080102
       01 WRK-NUM.                                                      00080200
          05 WRK-N1          PIC 9(02)        VALUE ZEROS.              00080300
          05 WRK-N2          PIC 9(02)        VALUE ZEROS.              00080400
          05 WRK-N3          PIC 9(02)        VALUE ZEROS.              00080500
          05 WRK-RES         PIC -ZZZ         VALUE ZEROS.              00080600
                                                                        00080700
      *================================================================*00080800
       PROCEDURE                        DIVISION.                       00080900
      *================================================================*00081000
                                                                        00081102
      *----------------------------------------------------------------*00081206
       0000-PRINCIPAL                   SECTION.                        00081306
      *----------------------------------------------------------------*00081406
                                                                        00081506
           ACCEPT WRK-NUM          FROM SYSIN.                          00081600
                                                                        00081702
      *--------------- SUBTRACT COM RES NEGATIVO-----------------------*00081801
                                                                        00081900
           SUBTRACT WRK-N1 WRK-N2 FROM WRK-N3 GIVING WRK-RES.           00082000
                                                                        00082100
           DISPLAY '--------------------------------------------'       00082202
           DISPLAY 'A SUBTRACAO      : ' WRK-N1.                        00082300
           DISPLAY 'E                : ' WRK-N2.                        00082400
           DISPLAY 'DE               : ' WRK-N3.                        00082500
           DISPLAY 'RESULTOU         : ' WRK-RES.                       00082600
           DISPLAY '--------------------------------------------'       00082700
                                                                        00082802
           STOP RUN.                                                    00083000
      *----------------------------------------------------------------*00083106
       0000-99--FIM.                   EXIT.                            00083207
      *----------------------------------------------------------------*00083306
                                                                        00083406
      *----------------------------------------------------------------*00084002
       9000-TRATAR-ERRO                SECTION.                         00085004
      *----------------------------------------------------------------*00086002
                                                                        00086102
      *----------------------------------------------------------------*00087002
       9000-99-FIM.                     EXIT.                           00088004
      *----------------------------------------------------------------*00089002
