      *================================================================J00001000
       IDENTIFICATION                  DIVISION.                        00002000
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID. FR06CB27.                                            00005000
                                                                        00006000
      *================================================================*00007000
      *                                                                 00008000
      *     AUTOR.....: JOEI LORENTI                                    00009000
      *     ANALISTA..: IVAN SANCHES                                    00009100
      *     EMPRESA...: FOURSYS                                         00009200
      *     DATA......: 28/04/2022                                      00009300
      *                                                                 00009400
      *----------------------------------------------------------------*00009500
      *                                                                 00009600
      *     OBJETIVO: RECEBER NAS VARIAVEIS WRK-DATA -> 26042022,       00009700
      *               WRK-LANCAMENTO -> PAGAMENTO TITULO(X30)           00009800
      *               WRK-VALOR -> 008000(2 DEC)                        00009900
      *               WRK-TIPO -> C                                     00010000
      *               RECEBER OS VALORAS DA SYSIN, MOSTRANDO MENSAGEM:  00020000
      *               WRK-TIPO = 'C' OU 'D' - 'PROCESSAR-ARQUIVO'       00021000
      *               CASO CONTRARIO - 'TRATAR-ERRO'                    00022000
      *               *** USO DA VARIAVEL NIVEL 88  ***                 00023000
      *================================================================*00024000
       ENVIRONMENT                      DIVISION.                       00025000
      *================================================================*00026000
                                                                        00027000
      *----------------------------------------------------------------*00028000
       CONFIGURATION                    SECTION.                        00029000
      *----------------------------------------------------------------*00030000
                                                                        00040000
        SPECIAL-NAMES.                                                  00050000
              DECIMAL-POINT            IS COMMA.                        00060000
                                                                        00070000
      *----------------------------------------------------------------*00071000
                                                                        00072000
      *================================================================J00073000
       DATA                            DIVISION.                        00074000
      *================================================================*00074100
                                                                        00074200
      *----------------------------------------------------------------*00074300
       WORKING-STORAGE                 SECTION.                         00074400
      *----------------------------------------------------------------*00074500
       01 WRK-REGISTRO.                                                 00074600
          05 WRK-DATA                  PIC 9(08)        VALUE ZEROS.    00074700
          05 WRK-LANCAMENTO            PIC X(30)        VALUE SPACES.   00074800
          05 WRK-VALOR                 PIC 9(06)V99     VALUE ZEROS.    00074900
          05 WRK-TIPO                  PIC X(01)        VALUE ZEROS.    00075000
            88 WRK-TIPO-VALIDO                          VALUE 'C' 'D'.  00075100
                                                                        00075200
       77 WRK-MENSAGEM                 PIC X(45)        VALUE SPACES.   00075300
                                                                        00075400
      *----------------------------------------------------------------*00075501
      *                        AREA DE ACUMULADORES                    *00075601
      *----------------------------------------------------------------*00075701
                                                                        00075901
       01 WRK-ACU-LIDOS                PIC 9(02)        VALUE ZEROS.    00076001
                                                                        00076101
                                                                        00076201
      *================================================================*00076300
       PROCEDURE                       DIVISION.                        00076400
      *================================================================*00076500
                                                                        00076600
      *----------------------------------------------------------------*00076700
       0000-PRINCIPAL                   SECTION.                        00076800
      *----------------------------------------------------------------*00076900
                                                                        00077000
           PERFORM 0100-INICIAR.                                        00077100
               IF WRK-DATA NOT EQUAL ZEROS                              00077200
                  PERFORM 0200-PROCESSAR                                00077300
                            UNTIL WRK-DATA GREATER 11052022             00077410
               END-IF.                                                  00077502
                                                                        00077604
           PERFORM 0300-FINALIZAR.                                      00077700
                                                                        00077800
           STOP RUN.                                                    00077900
                                                                        00078000
      *----------------------------------------------------------------*00078100
       0000-99-FIM.                    EXIT.                            00078200
      *----------------------------------------------------------------*00078300
                                                                        00078400
      *----------------------------------------------------------------*00078500
       0100-INICIAR                    SECTION.                         00078600
      *----------------------------------------------------------------*00078700
                                                                        00078800
           ACCEPT WRK-REGISTRO         FROM SYSIN.                      00078900
                                                                        00079000
      *----------------------------------------------------------------*00079100
       0100-99-FIM                     SECTION.                         00079200
      *----------------------------------------------------------------*00079300
      *----------------------------------------------------------------*00079400
       0200-PROCESSAR                  SECTION.                         00079500
      *----------------------------------------------------------------*00079600
                                                                        00079700
               IF WRK-TIPO-VALIDO                                       00079800
                 MOVE 'PROCESSAR ARQUIVO'                               00079908
                                       TO WRK-MENSAGEM                  00080000
               ELSE                                                     00080100
                 MOVE 'TRATAR-ERRO'                                     00080200
                                       TO WRK-MENSAGEM                  00080300
               END-IF.                                                  00080406
                                                                        00080500
             DISPLAY WRK-REGISTRO '--' WRK-MENSAGEM.                    00080606
                                                                        00080701
             ADD 1                     TO WRK-ACU-LIDOS.                00080906
                                                                        00081001
             ACCEPT WRK-REGISTRO       FROM SYSIN.                      00081105
                                                                        00081200
      *----------------------------------------------------------------*00081300
       0200-99-FIM.                    EXIT.                            00081400
      *----------------------------------------------------------------*00081500
                                                                        00081600
      *----------------------------------------------------------------*00081700
       0300-FINALIZAR                  SECTION.                         00081800
      *----------------------------------------------------------------*00081900
                                                                        00082000
             DISPLAY WRK-ACU-LIDOS.                                     00082101
                                                                        00082200
      *----------------------------------------------------------------*00082300
       0300-99-FIM.                    EXIT.                            00082400
      *----------------------------------------------------------------*00082500
                                                                        00082600
      *----------------------------------------------------------------*00082700
       9000-TRATAR-ERRO                SECTION.                         00082800
      *----------------------------------------------------------------*00082900
      *----------------------------------------------------------------*00083000
       9000-99-FIM.                    EXIT.                            00083100
      *----------------------------------------------------------------*00084000
