       IDENTIFICATION                  DIVISION.                        00010000
       PROGRAM-ID. FR06CB11.                                            00020003
      *================================================================*00030000
      *     AUTOR   : JOEI LORENTI                                      00040000
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : 22/04/2022                                        00060001
      *     OBJETIVO: RECEBER VIA SYSIN DOIS NUMEROS NAS VARIAVEIS      00070001
      *               WRK-N1, WRK-N2, SUBTRAIR  DEVOLVENDO EM WRK-RES.  00071001
      *================================================================*00072000
      *ENVIRONMENT                      DIVISION.                       00073000
      *================================================================*00074000
      *================================================================*00075000
       DATA                             DIVISION.                       00076000
      *================================================================*00077000
      *================================================================*00078000
       WORKING-STORAGE                  SECTION.                        00079000
      *================================================================*00080000
       01 WRK-NUM.                                                      00080100
          05 WRK-N1          PIC 9(02)        VALUE ZEROS.              00080200
          05 WRK-N2          PIC 9(02)        VALUE ZEROS.              00080300
      *   05 WRK-N3          PIC 9(02)        VALUE ZEROS.              00080401
          05 WRK-RES         PIC 9(03)        VALUE ZEROS.              00080500
                                                                        00080600
      *================================================================*00080700
       PROCEDURE                        DIVISION.                       00080800
      *================================================================*00080900
           ACCEPT WRK-NUM          FROM SYSIN.                          00081000
      *--------------- SUBTRACT----------------------------------------*00081103
                                                                        00081200
           SUBTRACT WRK-N1 FROM WRK-N2 GIVING WRK-RES.                  00081301
                                                                        00081401
      *----------------------------------------------------------------*00081500
           DISPLAY '-------------------------------------------'        00081600
           DISPLAY 'A SUBTRACAO      : ' WRK-N1.                        00081702
           DISPLAY 'DE               : ' WRK-N2.                        00081802
           DISPLAY 'RESULTOU EM      : ' WRK-RES.                       00082001
           DISPLAY '--------------------------------------------'       00082100
           STOP RUN.                                                    00083000
