       IDENTIFICATION                  DIVISION.                        00010000
       PROGRAM-ID. FR06CB10.                                            00020000
      *================================================================*00030000
      *     AUTOR   : JOEI LORENTI                                      00040000
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : 20/04/2022                                        00060000
      *     OBJETIVO:   IMPRIMIR NA SYSOUT A SOMA WRK-N1, WRK-N2,       00070000
      *                WRK-N3 RESULTADO EM WRK-RES +10 .                00071000
      *================================================================*00072000
      *ENVIRONMENT                      DIVISION.                       00073000
      *================================================================*00074000
      *================================================================*00075000
       DATA                             DIVISION.                       00076000
      *================================================================*00077000
      *================================================================*00078000
       WORKING-STORAGE                  SECTION.                        00079000
      *================================================================*00080000
       01 WRK-NUM.                                                      00080100
          05 WRK-N1          PIC 9(02)        VALUE ZEROS.              00080200
          05 WRK-N2          PIC 9(02)        VALUE ZEROS.              00080300
          05 WRK-N3          PIC 9(02)        VALUE ZEROS.              00080400
          05 WRK-RES         PIC 9(03)        VALUE ZEROS.              00080500
                                                                        00080600
      *================================================================*00080700
       PROCEDURE                        DIVISION.                       00080800
      *================================================================*00080900
           ACCEPT WRK-NUM          FROM SYSIN.                          00081000
      *--------------- ADD COM TO--------------------------------------*00081100
      *--------------- ADD COM TO--------------------------------------*00081200
                                                                        00081300
           ADD WRK-N1 WRK-N2 WRK-N3 TO WRK-RES.                         00081400
           ADD 10                   TO WRK-RES.                         00081500
           DISPLAY '-------------------------------------------'        00081600
           DISPLAY 'A SOMA DE    : ' WRK-N1.                            00081700
           DISPLAY 'COM          : ' WRK-N2.                            00081800
           DISPLAY 'COM          : ' WRK-N3.                            00081900
           DISPLAY 'RESULTOU     : ' WRK-RES.                           00082000
           DISPLAY '--------------------------------------------'       00082100
           STOP RUN.                                                    00083000
