       IDENTIFICATION                  DIVISION.                        00010000
       PROGRAM-ID. FR06CB09.                                            00020007
      *================================================================*00030000
      *     AUTOR   : JOEI LORENTI                                      00040000
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : 20/04/2022                                        00060000
      *     OBJETIVO:   IMPRIMIR NA SYSOUT A SOMA WRK-N1, WRK-N2,       00070000
      *                RESULTADO EM WRK-RES.                            00071006
      *================================================================*00072006
      *ENVIRONMENT                      DIVISION.                       00073000
      *================================================================*00074000
      *================================================================*00075000
       DATA                             DIVISION.                       00076000
      *================================================================*00077000
      *================================================================*00078000
       WORKING-STORAGE                  SECTION.                        00079000
      *================================================================*00080000
       01 WRK-NUM.                                                      00080100
          05 WRK-N1          PIC 9(02)        VALUE ZEROS.              00080200
          05 WRK-N2          PIC 9(02)        VALUE ZEROS.              00080300
          05 WRK-RES         PIC 9(03)        VALUE 1.                  00080405
                                                                        00080500
      *================================================================*00080600
       PROCEDURE                        DIVISION.                       00080700
      *================================================================*00080800
           ACCEPT WRK-NUM          FROM SYSIN.                          00080900
      *--------------- ADD COM TO                                       00081000
           ADD WRK-N1 WRK-N2     TO  WRK-RES.                           00082000
           DISPLAY 'ADD COM TO   '                                      00082200
           DISPLAY '-------------------------------------------'        00082300
           DISPLAY 'A SOMA DE    : ' WRK-N1.                            00083000
           DISPLAY 'COM          : ' WRK-N2.                            00083100
           DISPLAY 'RESULTOU     : ' WRK-RES.                           00083200
           DISPLAY '--------------------------------------------'       00083301
           STOP RUN.                                                    00083400
