      *================================================================*00001001
       IDENTIFICATION                  DIVISION.                        00002001
      *================================================================J00003001
                                                                        00004001
       PROGRAM-ID.  FR06CB35.                                           00005001
                                                                        00006001
      *================================================================*00007001
      *                                                                 00007101
      *     AUTOR.......: JOEI LORENTI                                  00007201
      *     ANALISTA....: IVAN SANCHES                                  00007301
      *     EMPRESA.....: FOURSYS                                       00007401
      *     DATA........: 13/05/2022                                    00007501
      *                                                                 00007601
      *----------------------------------------------------------------*00007701
      *                                                                 00007801
      *     OBJETIVO: 1-LER TODOS OS REGISTROS DO ARQUIVO SEQUENCIAL    00007901
      *                 (EPAGFORN)LRECL - 68.                           00008001
      *               2-GERAR UM ARQUIVO RELATORIO COM TODOS OS         00008101
      *                 REGISTROS DE PESSOA FÍSICA (SPAGFORN) - 46.     00008201
      *               3-A CADA 10 REGISTROS PULAR 1 PAGINA.             00008501
      *               5-MOSTRAR LIDOS, GRAVADOS E  TOTAL NA SYSOUT.     00008601
      *               DE NOTAS EMITIDAS E GRAVADAS  NA SYSOUT.          00008701
      *                                                                 00008801
      *----------------------------------------------------------------*00008901
      *                                                                 00009001
      *     INPUT:                                                      00009101
      *     DDNAME           I/O                                        00009201
      *     EPAGFORN          I                                         00009301
      *     SPAGFORN          O                                         00009401
      *                                                                 00009501
      *================================================================*00009601
                                                                        00009701
      *================================================================*00009801
       ENVIRONMENT                     DIVISION.                        00009901
      *================================================================J00010001
                                                                        00010101
      *----------------------------------------------------------------*00010201
       CONFIGURATION                   SECTION.                         00010301
      *----------------------------------------------------------------*00010401
                                                                        00010501
       SPECIAL-NAMES.                                                   00010601
           DECIMAL-POINT IS COMMA.                                      00010701
                                                                        00010801
      *----------------------------------------------------------------*00010901
       INPUT-OUTPUT                    SECTION.                         00011001
      *----------------------------------------------------------------*00011101
                                                                        00011201
       FILE-CONTROL.                                                    00011301
             SELECT EPAGFORN           ASSIGN TO JCLEPAG                00011401
                FILE STATUS            IS WRK-FS-EPAGFORN.              00011501
                                                                        00011601
             SELECT SPAGFORN           ASSIGN TO JCLSPAG                00011701
                FILE STATUS            IS WRK-FS-SPAGFORN.              00011801
                                                                        00011901
      *================================================================*00012001
       DATA                            DIVISION.                        00012101
      *================================================================*00012201
                                                                        00012301
      *----------------------------------------------------------------*00012401
       FILE                            SECTION.                         00012501
      *----------------------------------------------------------------*00012601
                                                                        00012701
      *----------------------------------------------------------------*00012801
      *                                                                *00012901
      *    INPUT - DADOS DO ARQUIVO DE ENTRADA EPAGFORN - LRECL = 068  *00013001
      *                                                                *00013101
      *----------------------------------------------------------------*00014001
                                                                        00015001
       FD  EPAGFORN                                                     00016001
            RECORDING MODE IS F                                         00017001
            BLOCK CONTAINS 0 RECORDS.                                   00018001
                                                                        00019001
       01  FD-EPAGFORN PIC X(68).                                       00020001
                                                                        00021001
      *----------------------------------------------------------------*00022001
      *                                                                *00022101
      *    OUTPUT - DADOS DO ARQUIVO DE SAIDA SPAGFORN - LRECL = 046   *00022201
      *                                                                *00022301
      *----------------------------------------------------------------*00022401
                                                                        00022501
       FD  SPAGFORN                                                     00022601
            RECORDING MODE IS F                                         00022701
            BLOCK CONTAINS 0 RECORDS.                                   00022801
                                                                        00022901
       01  FD-SPAGFORN PIC X(46).                                       00023001
                                                                        00024001
                                                                        00025001
      *----------------------------------------------------------------*00026001
       WORKING-STORAGE                 SECTION.                         00027001
      *----------------------------------------------------------------*00027101
                                                                        00027201
      *----------------------------------------------------------------*00027301
       01  FILLER                      PIC X(50)    VALUE               00027401
           '***AREA DO AQUIVO EPAGFORN***'.                             00027501
      *----------------------------------------------------------------*00027601
                                                                        00027701
      *  COPY 'B#CLI'.                                                  00027801
                                                                        00027901
       01 REG-EPAGFORN.                                                 00028001
           05 DATA-EMISSAO             PIC 9(08)    VALUE ZEROS.        00028101
           05 CPF-CNPJ.                                                 00028201
              10 FILLER                PIC X(10)    VALUE SPACES.       00028301
              10 VALIDA-CPF            PIC 9(03)    VALUE ZEROS.        00028401
              10 VALIDA-CNPJ           PIC 9(01)    VALUE ZEROS.        00028501
           05 FORNECEDOR               PIC X(30)    VALUE SPACES.       00028601
           05 NOTA-FISCAL              PIC 9(08)    VALUE ZEROS.        00028701
           05 VALOR                    PIC 9(08)    VALUE ZEROS.        00028801
                                                                        00028901
      *----------------------------------------------------------------*00029001
                                                                        00029201
      *----------------------------------------------------------------*00029701
       01  FILLER                      PIC X(50)    VALUE               00029801
           '***AREA DO AQUIVO SPAGFORN***'.                             00029901
      *----------------------------------------------------------------*00030001
                                                                        00030101
      *  COPY 'B#RELCLI'.                                               00030201
                                                                        00030301
       01 REG-SPAGFORN.                                                 00030401
           05 CPF-CNPJ2                PIC X(14)    VALUE SPACES.       00030501
           05 NOTA-FISCAL2             PIC 9(08)    VALUE ZEROS.        00030601
           05 VALOR2                   PIC 9(08)    VALUE ZEROS.        00030701
           05 DATA-EMISSAO2            PIC 9(08)    VALUE ZEROS.        00030801
           05 DATA-GRAVACAO            PIC 9(08)    VALUE ZEROS.        00031501
                                                                        00032901
      *----------------------------------------------------------------*00033001
       01  FILLER                      PIC X(50)               VALUE    00033101
           '**** AREA DE VARIAVEIS DE FILE-STATUS ****'.                00033201
      *----------------------------------------------------------------*00033301
                                                                        00033401
       77 WRK-FS-EPAGFORN              PIC X(02)    VALUE SPACES.       00033501
                                                                        00033601
       77 WRK-FS-SPAGFORN              PIC X(02)    VALUE SPACES.       00033701
                                                                        00033801
      *----------------------------------------------------------------*00033901
       01  FILLER                      PIC X(50)               VALUE    00034001
           '**** AREA DE AUXILIARES ****'.                              00034101
      *----------------------------------------------------------------*00034201
                                                                        00034301
       77 WRK-MSG                      PIC X(50)    VALUE SPACES.       00034401
                                                                        00034501
       77 WRK-ACU-GRAVADOS             PIC 9(002)   VALUE ZEROS.        00034601
                                                                        00034701
       77 WRK-ACU-LIDOS                PIC 9(002)   VALUE ZEROS.        00034801
                                                                        00034901
       77 WRK-PAGINA                   PIC X(20)    VALUE SPACES.       00035001
                                                                        00035101
       77 WRK-LINHAS                   PIC 9(02)    VALUE ZEROS.        00035201
                                                                        00035301
      *01 WRK-TOTAL-CHAVE.                                              00035401
      *    05 FILLER                       PIC X(35)    VALUE           00035501
      *       '------------ TOTAL CHAVE ---------'.                     00035601
      *    05 FILLER                       PIC X(06)    VALUE SPACES.   00035701
      *    05 WRK-SALDO-CHAVE              PIC 9(08)    VALUE ZEROS.    00035801
      *                                                                 00035901
      *77 WRK-CHAVE-QUEBRA             PIC 9(09)    VALUE ZEROS.        00036001
      *                                                                 00036101
                                                                        00036201
                                                                        00036301
                                                                        00036401
      *----------------------------------------------------------------*00036501
       01  FILLER                      PIC X(50)               VALUE    00036601
           '****  AREA DE REDEFINES ****'.                              00036701
      *----------------------------------------------------------------*00036801
                                                                        00036901
      *----------------------------------------------------------------*00037001
       01  FILLER                      PIC X(50)               VALUE    00037101
           '****  AREA CABECALHO ****'.                                 00037201
      *----------------------------------------------------------------*00037301
                                                                        00037401
                                                                        00037501
       01 WRK-CABEC1.                                                   00037601
          05 FILLER                    PIC X(42) VALUE                  00037701
           'RELATORIO FORNECEDOR PESSOA FISICA - PAG: '.                00037801
          05 WRK-NUM-PAG               PIC 9(02)    VALUE ZEROS.        00037901
          05 FILLER                    PIC X(02).                       00038001
                                                                        00038101
       01 LINHA.                                                        00038201
          05 FILLER                    PIC X(46) VALUE ALL '-'.         00038301
                                                                        00038401
       01 WRK-CABEC2.                                                   00038501
          05 FILLER                    PIC X(07) VALUE 'CPFCNPJ'.       00038601
          05 FILLER                    PIC X(02) VALUE SPACES.          00038701
          05 FILLER                    PIC X(08) VALUE 'NTFISCAL'.      00038801
          05 FILLER                    PIC X(02) VALUE SPACES.          00038901
          05 FILLER                    PIC X(05) VALUE 'VALOR'.         00039001
          05 FILLER                    PIC X(02) VALUE SPACES.          00039101
          05 FILLER                    PIC X(09) VALUE 'DTEMISSAO'.     00039201
          05 FILLER                    PIC X(01) VALUE SPACES.          00039301
          05 FILLER                    PIC X(10) VALUE 'DTGRAVACAO'.    00039401
                                                                        00039501
                                                                        00039601
      *================================================================*00039701
       PROCEDURE DIVISION.                                              00039801
      *================================================================*00039901
                                                                        00040001
      *----------------------------------------------------------------*00040101
       0000-PRINCIPAL                  SECTION.                         00040201
      *----------------------------------------------------------------*00040301
                                                                        00040401
           PERFORM 1000-INICIAR.                                        00040501
                                                                        00040601
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-EPAGFORN EQUAL '10'.     00040701
                                                                        00040801
      *           PERFORM 2100-SOMAR-SALDO.                             00040901
                                                                        00041001
           PERFORM 3000-FINALIZAR.                                      00041101
                                                                        00041201
           STOP RUN.                                                    00041301
                                                                        00041401
      *----------------------------------------------------------------*00041501
       0000-99-FIM.                    EXIT.                            00041601
      *----------------------------------------------------------------*00041701
                                                                        00041801
      *----------------------------------------------------------------*00041901
       1000-INICIAR                    SECTION.                         00042001
      *----------------------------------------------------------------*00042101
                                                                        00042201
           OPEN INPUT  EPAGFORN                                         00042301
                OUTPUT SPAGFORN                                         00042401
                                                                        00042501
           PERFORM 1100-TESTAR-FILE-STATUS.                             00042601
                READ EPAGFORN INTO REG-EPAGFORN.                        00042701
                                                                        00042801
      *----------------------------------------------------------------*00042901
       1000-99-FIM.            EXIT.                                    00043001
      *----------------------------------------------------------------*00043101
      *----------------------------------------------------------------*00043201
       1100-TESTAR-FILE-STATUS         SECTION.                         00043301
      *----------------------------------------------------------------*00043401
                                                                        00043501
                                                                        00043601
            PERFORM 1110-TESTAR-FILE-STATUS-EPAG.                       00043701
                                                                        00043801
                                                                        00043901
            PERFORM 1120-TESTAR-FILE-STATUS-SPAG.                       00044001
                                                                        00044101
      *----------------------------------------------------------------*00044201
       1100-99-FIM.                    EXIT.                            00044301
      *----------------------------------------------------------------*00044401
                                                                        00044501
      *----------------------------------------------------------------*00044601
       1110-TESTAR-FILE-STATUS-EPAG    SECTION.                         00044701
      *----------------------------------------------------------------*00044801
                                                                        00044901
            IF WRK-FS-EPAGFORN         NOT EQUAL ZEROS                  00045001
                MOVE ' ERRO ABERTURA EPAGFORN '                         00045101
                                       TO WRK-MSG                       00045201
                PERFORM 9000-TRATAR-ERROS                               00045301
            ELSE                                                        00045401
                PERFORM 2200-GRAVAR-CABEC                               00045501
            END-IF.                                                     00045601
                                                                        00045701
      *----------------------------------------------------------------*00045801
       1110-99-FIM.                    EXIT.                            00045901
      *----------------------------------------------------------------*00046001
                                                                        00046101
      *----------------------------------------------------------------*00046201
       1120-TESTAR-FILE-STATUS-SPAG    SECTION.                         00046301
      *----------------------------------------------------------------*00046401
                                                                        00046501
            IF WRK-FS-SPAGFORN         NOT EQUAL ZEROS                  00046601
                 MOVE ' ERRO ABERTURA SPAGFORN '                        00046701
                                       TO WRK-MSG                       00046801
                 PERFORM 9000-TRATAR-ERROS                              00046901
            END-IF.                                                     00047001
                                                                        00047101
      *----------------------------------------------------------------*00047201
       1120-99-FIM.                    EXIT.                            00047301
      *----------------------------------------------------------------*00047401
      *----------------------------------------------------------------*00047501
       2000-PROCESSAR                  SECTION.                         00047601
      *----------------------------------------------------------------*00047701
            ADD 1 TO WRK-ACU-LIDOS                                      00047801
            ADD 1 TO WRK-LINHAS                                         00047901
      *------TESTAR CHAVE ATUAL IGUAL ANTERIOR                          00048001
      *     IF FD-CHAVE-CLIENTES       EQUAL WRK-CHAVE-QUEBRA           00048101
      *        ADD FD-SALDO-CLIENTES   TO WRK-SALDO-CHAVE               00048201
      *     ELSE                                                        00048301
      *---SE NAO FOR GRAVA O SALDO DA ULTIMA CHAVE E ATUALIZA CH ATUAL  00048401
      *                                                                 00048501
      *     WRITE FD-RELATCLI          FROM WRK-TOTAL-CHAVE             00048601
      *     WRITE FD-RELATCLI          FROM WRK-LINHAS                  00048701
      *     MOVE  FD-CHAVE-CLIENTES    TO   WRK-CHAVE-QUEBRA            00048801
      *          COMPUTE WRK-SALDO-CHAVE = FD-SALDO-CLIENTES            00048901
      *      END-IF.                                                    00049001
                                                                        00049101
            IF WRK-LINHAS              GREATER 10                       00049201
              ADD 1                    TO WRK-NUM-PAG                   00049301
              WRITE FD-SPAGFORN        FROM LINHA                       00049401
              WRITE FD-SPAGFORN        FROM WRK-CABEC1 AFTER PAGE       00049501
              WRITE FD-SPAGFORN        FROM WRK-CABEC2 AFTER 2 LINES    00049601
              WRITE FD-SPAGFORN        FROM LINHA                       00049701
              MOVE 1                   TO WRK-LINHAS                    00049801
                                                                        00049901
            END-IF.                                                     00050001
                                                                        00050101
            MOVE SPACES                TO FD-SPAGFORN                   00050201
                                                                        00050301
            MOVE DATA-EMISSAO          TO DATA-EMISSAO2                 00050401
                                                                        00050501
            MOVE CPF-CNPJ              TO CPF-CNPJ2                     00050601
                                                                        00050701
            MOVE VALOR                 TO VALOR2                        00050801
                                                                        00050901
            ACCEPT DATA-GRAVACAO        FROM DATE                       00051001
                                                                        00051101
            WRITE FD-SPAGFORN          FROM REG-SPAGFORN                00051501
                                                                        00051601
              ADD 1                    TO WRK-ACU-GRAVADOS              00051701
                                                                        00051801
                                                                        00051901
      *-----------------LER PROXIMO REGISTRO - SAIR DO LOOP------------*00052001
                                                                        00052101
            READ EPAGFORN              INTO REG-EPAGFORN.               00052201
                                                                        00052301
            IF WRK-FS-EPAGFORN         EQUAL '10'                       00052401
              MOVE 'FINAL DE ARQUIVO ' TO WRK-MSG                       00052501
            END-IF.                                                     00052601
                                                                        00052701
            ADD 1                      TO WRK-ACU-LIDOS.                00052801
                                                                        00052901
                                                                        00053001
                                                                        00053101
      *----------------------------------------------------------------*00053201
       2000-99-FIM.                    EXIT.                            00053301
      *----------------------------------------------------------------*00053401
                                                                        00053501
      *----------------------------------------------------------------*00053601
      *2100-SOMAR-SALDO                SECTION.                         00053701
      *----------------------------------------------------------------*00053801
                                                                        00053901
      *     MOVE WRK-SOMA-SALD         TO SALDO                         00054001
      *     WRITE FD-RELATCLI          FROM RODAPE.                     00054101
                                                                        00054201
                                                                        00054301
      *----------------------------------------------------------------*00054401
      *2100-99-FIM.                    EXIT.                            00054501
      *----------------------------------------------------------------*00054601
                                                                        00054701
      *----------------------------------------------------------------*00054801
       2200-GRAVAR-CABEC               SECTION.                         00054901
      *----------------------------------------------------------------*00055001
                                                                        00055101
            MOVE 1 TO WRK-NUM-PAG.                                      00055201
                WRITE FD-SPAGFORN      FROM WRK-CABEC1 AFTER PAGE.      00055301
                WRITE FD-SPAGFORN      FROM LINHA.                      00055401
                WRITE FD-SPAGFORN      FROM WRK-CABEC2 AFTER 2 LINES.   00055501
                                                                        00055601
                                                                        00055701
      *----------------------------------------------------------------*00055801
       2200-99-FIM.                    EXIT.                            00055901
      *----------------------------------------------------------------*00056001
                                                                        00056101
      *----------------------------------------------------------------*00056201
       3000-FINALIZAR                  SECTION.                         00056301
      *----------------------------------------------------------------*00056401
                                                                        00056501
            DISPLAY 'TOTAL LIDOS       : '     WRK-ACU-LIDOS            00056601
            DISPLAY 'TOTAL GRAVADOS    : '     WRK-ACU-GRAVADOS         00056701
            DISPLAY '--------------------------------------------------'00056801
                                                                        00057001
            CLOSE EPAGFORN                                              00057101
            CLOSE SPAGFORN                                              00057201
              IF WRK-FS-EPAGFORN       NOT EQUAL ZEROS                  00057301
                MOVE ' STATUS NO CLOSE '                                00057401
                                       TO WRK-MSG                       00057501
                PERFORM 9000-TRATAR-ERROS                               00057601
              END-IF.                                                   00057701
                                                                        00057801
      *----------------------------------------------------------------*00057901
       3000-99-FIM.                    EXIT.                            00058001
      *----------------------------------------------------------------*00058101
                                                                        00058201
      *----------------------------------------------------------------*00058301
       9000-TRATAR-ERROS               SECTION.                         00058401
      *----------------------------------------------------------------*00058501
                                                                        00058601
            DISPLAY '-------------------STATUS-----------------------'. 00058701
            DISPLAY '  MENSAGEM        '  WRK-MSG.                      00058801
            DISPLAY '  FILE STATUS     '  WRK-FS-EPAGFORN               00058901
            DISPLAY '  FILE STATUS     '  WRK-FS-SPAGFORN.              00059001
            DISPLAY '------------------------------------------------'. 00059101
                                                                        00059201
            STOP RUN.                                                   00059301
                                                                        00059401
      *---------------------------------------------------------------* 00059501
       9000-99-FIM.                    EXIT.                            00059601
      *----------------------------------------------------------------*00059701
                                                                        00059801
