      *================================================================*00001001
       IDENTIFICATION                            DIVISION.              00002001
      *================================================================J00003001
                                                                        00004001
       PROGRAM-ID.  FR06CB32.                                           00005001
                                                                        00006001
      *================================================================*00007001
      *     AUTOR.......: JOEI LORENTI                                  00008001
      *     ANALISTA....: IVAN SANCHES                                  00008101
      *     EMPRESA.....: FOURSYS                                       00008201
      *     DATA........: 05/05/2022                                    00008301
      *----------------------------------------------------------------*00008401
      *                                                                 00008501
      *     OBJETIVO: LER ARQUIVO (ROTINA)                              00008601
      *               REVISAO                                           00008701
      *                                                                 00008801
      *----------------------------------------------------------------*00008901
      *     INPUT:                                                      00009001
      *     DDNAME           I/O                                        00009101
      *     ROTINA            I                                         00009201
      *                                                                 00009301
      *                                                                 00009401
      *================================================================*00009501
                                                                        00009601
      *================================================================*00009701
       ENVIRONMENT                               DIVISION.              00009801
      *================================================================*00009901
                                                                        00010001
      *----------------------------------------------------------------*00010101
       CONFIGURATION                             SECTION.               00010201
      *----------------------------------------------------------------*00010301
                                                                        00010401
       SPECIAL-NAMES.                                                   00010501
           DECIMAL-POINT IS COMMA.                                      00010601
                                                                        00010701
      *----------------------------------------------------------------*00010801
       INPUT-OUTPUT                              SECTION.               00010901
      *----------------------------------------------------------------*00011001
                                                                        00012001
       FILE-CONTROL.                                                    00013001
             SELECT ROTINA             ASSIGN TO JCLROT                 00014001
                FILE STATUS            IS WRK-FS-ROTINA.                00015001
                                                                        00018001
      *================================================================*00019001
       DATA                                      DIVISION.              00020001
      *================================================================*00021001
                                                                        00022001
      *----------------------------------------------------------------*00023001
       FILE                                      SECTION.               00024001
      *----------------------------------------------------------------*00025001
                                                                        00026001
       FD ROTINA                                                        00027003
           RECORDING MODE IS F                                          00027101
           BLOCK CONTAINS 0 RECORDS.                                    00027201
       01 FD-ROTINA PIC X(44).                                          00027301
                                                                        00027401
                                                                        00028001
      *----------------------------------------------------------------*00028101
       WORKING-STORAGE                           SECTION.               00028201
      *----------------------------------------------------------------*00028301
                                                                        00028401
      *----------------------------------------------------------------*00028501
      * AREA AQUIVO ROTINA                                              00028601
      *----------------------------------------------------------------*00028701
                                                                        00028801
       COPY 'B#ROT'.                                                    00028906
                                                                        00029001
      *01 WRK-ROTINA.                                                   00029106
      *  05 WRK-DIA                    PIC X(15)    VALUE SPACES.       00029206
      *  05 WRK-EVENTO                 PIC X(25)    VALUE SPACES.       00029306
      *  05 WRK-HORARIO                PIC 9(04)    VALUE ZEROS.        00029406
                                                                        00029807
      *----------------------------------------------------------------*00029901
       01 FILLER                       PIC X(50)               VALUE    00030001
            '**** AREA DE VARIAVEIS DA FILE SEC ****'.                  00030101
      *----------------------------------------------------------------*00030201
                                                                        00030301
       77 WRK-FS-ROTINA                PIC X(02) VALUE SPACES.          00030401
                                                                        00030701
      *----------------------------------------------------------------*00030801
       01 FILLER                       PIC X(50)               VALUE    00030901
            '**** AREA DE AUXILIARES ****'.                             00031001
      *----------------------------------------------------------------*00032001
                                                                        00032101
       77 WRK-MSG                      PIC X(50) VALUE SPACES.          00032201
                                                                        00032601
      *----------------------------------------------------------------*00032701
       01 FILLER                       PIC X(50)               VALUE    00032801
            '****  AREA DE REDEFINES ****'.                             00032901
      *----------------------------------------------------------------*00033001
                                                                        00033101
      *================================================================*00033201
       PROCEDURE DIVISION.                                              00033301
      *================================================================*00033401
                                                                        00033501
      *----------------------------------------------------------------*00033601
       0000-PRINCIPAL                     SECTION.                      00033701
      *----------------------------------------------------------------*00033801
                                                                        00033901
           PERFORM 1000-INICIAR.                                        00034001
                                                                        00035001
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-ROTINA EQUAL '10'.       00036001
                                                                        00037001
           PERFORM 3000-FINALIZAR.                                      00037101
                                                                        00037201
                                                                        00037301
           STOP RUN.                                                    00037401
                                                                        00037501
      *----------------------------------------------------------------*00037601
       0000-99-FIM.            EXIT.                                    00037701
      *----------------------------------------------------------------*00037801
                                                                        00037901
      *----------------------------------------------------------------*00038001
       1000-INICIAR                       SECTION.                      00038101
      *----------------------------------------------------------------*00038201
            OPEN INPUT ROTINA                                           00039001
            PERFORM 1100-TESTAR-FILE-STATUS.                            00040001
                READ ROTINA INTO WRK-ROTINA.                            00040101
                                                                        00040201
      *----------------------------------------------------------------*00040301
       1000-99-FIM.            EXIT.                                    00040401
      *----------------------------------------------------------------*00040501
      *----------------------------------------------------------------*00040601
       1100-TESTAR-FILE-STATUS            SECTION.                      00040701
      *----------------------------------------------------------------*00040801
                                                                        00040901
            IF WRK-FS-ROTINA NOT EQUAL ZEROS                            00041001
                 MOVE ' ERRO ABERTURA ROTINA '                          00041101
                                       TO WRK-MSG                       00041201
                 PERFORM 9000-TRATAR-ERROS                              00041305
            ELSE                                                        00041405
                READ ROTINA INTO WRK-ROTINA                             00041508
                  IF WRK-FS-ROTINA NOT EQUAL ZEROS                      00041605
                     DISPLAY ' FIM DE ARQUIVO '                         00041705
                  END-IF                                                00041805
            END-IF.                                                     00041901
                                                                        00042001
                                                                        00042101
      *----------------------------------------------------------------*00042201
       1100-99-FIM.                    EXIT.                            00042301
      *----------------------------------------------------------------*00042401
                                                                        00042501
      *----------------------------------------------------------------*00042601
       2000-PROCESSAR                  SECTION.                         00042701
      *----------------------------------------------------------------*00042801
                                                                        00042901
            IF WRK-FS-ROTINA           EQUAL ZEROS                      00043001
                 MOVE FD-ROTINA        TO WRK-ROTINA                    00043101
                                                                        00043204
                 DISPLAY '----------------------------'                 00043304
                 DISPLAY ' ROTINA SEMANAL ' WRK-ROTINA                  00043401
                 DISPLAY '----------------------------'                 00043504
            ELSE                                                        00043601
                MOVE ' FIM DE ARQUIVO '                                 00043701
                                       TO WRK-MSG                       00043801
            END-IF.                                                     00043901
                                                                        00044001
                READ ROTINA            INTO WRK-ROTINA.                 00044101
                                                                        00044201
      *----------------------------------------------------------------*00044301
       2000-99-FIM.                    EXIT.                            00044401
      *----------------------------------------------------------------*00044501
      *----------------------------------------------------------------*00044601
       3000-FINALIZAR                  SECTION.                         00044701
      *----------------------------------------------------------------*00044801
                                                                        00044901
            CLOSE ROTINA.                                               00045001
               IF WRK-FS-ROTINA NOT EQUAL ZEROS                         00045101
                 MOVE ' STATUS NO CLOSE '                               00045201
                                       TO WRK-MSG                       00045301
                 PERFORM 9000-TRATAR-ERROS                              00045401
               END-IF.                                                  00045501
                                                                        00045601
      *----------------------------------------------------------------*00045701
       3000-99-FIM.                    EXIT.                            00045801
      *----------------------------------------------------------------*00045901
                                                                        00046001
      *----------------------------------------------------------------*00046101
       9000-TRATAR-ERROS               SECTION.                         00046201
      *----------------------------------------------------------------*00046301
                                                                        00046401
             DISPLAY '-------------------STATUS-----------------------'.00046501
             DISPLAY '  MENSAGEM        '  WRK-MSG.                     00046601
             DISPLAY '  FILE STATUS     '  WRK-FS-ROTINA.               00046701
             DISPLAY '------------------------------------------------'.00046801
                                                                        00046901
      *----------------------------------------------------------------*00047001
       9000-99-FIM.                    EXIT.                            00047101
      *----------------------------------------------------------------*00047201
                                                                        00048001
