      *================================================================*00001002
       IDENTIFICATION                  DIVISION.                        00002002
      *================================================================*00003002
                                                                        00004002
       PROGRAM-ID. FR06CB22.                                            00005003
                                                                        00006002
      *================================================================*00007002
      *                                                                 00008002
      *     AUTOR   : JOEI LORENTI                                      00009002
      *     EMPRESA : FOURSYS                                           00010002
      *     DATA    : 26/04/2022                                        00020003
      *                                                                 00021004
      *----------------------------------------------------------------*00022004
      *                                                                 00023004
      *     OBJETIVO: SABENDO QUE A RELACAO DE 70% NO PRECO ENTRE       00030003
      *               ALCOOL E GASOLINA COMPENSA O USO DO ALCOOL,       00040003
      *               MOSTRAR NA SYSOUT OS DADOS INFORMADOS, A          00050003
      *               RELACAO(PERCENTUAL) E AS MENSAGENS:               00060003
      *               -> COMPRAR ALCOOL (SE MENOR QUE 70%)              00070004
      *               -> COMPRAR GASOLINA(SE MAIOR QUE 70%)             00070104
      *                                                                 00070204
      *================================================================*00071002
       ENVIRONMENT                      DIVISION.                       00071102
      *================================================================*00071202
                                                                        00071302
      *----------------------------------------------------------------*00071402
       CONFIGURATION                    SECTION.                        00071502
      *----------------------------------------------------------------*00071602
                                                                        00071704
       SPECIAL-NAMES.                                                   00071802
           DECIMAL-POINT               IS COMMA.                        00071905
                                                                        00072004
      *================================================================*00072102
       DATA                            DIVISION.                        00072205
      *================================================================*00072302
                                                                        00072402
      *----------------------------------------------------------------*00072502
       WORKING-STORAGE                 SECTION.                         00072605
      *----------------------------------------------------------------*00072702
                                                                        00072802
       01 WRK-COMB.                                                     00072910
         05 WRK-GASOLINA               PIC 9(2)V99     VALUE ZEROS.     00073011
         05 WRK-ALCOOL                 PIC 9(2)        VALUE ZEROS.     00073111
       77 WRK-TAXA                     PIC 9(2)V99     VALUE ZEROS.     00073211
                                                                        00073302
      *================================================================*00073402
       PROCEDURE                        DIVISION.                       00073502
      *================================================================*00073602
                                                                        00073702
      *----------------------------------------------------------------*00073802
       0000-PRINCIPAL                   SECTION.                        00073902
      *----------------------------------------------------------------*00074002
                                                                        00074102
           ACCEPT WRK-COMB             FROM SYSIN                       00075009
           COMPUTE WRK-TAXA = WRK-ALCOOL / WRK-GASOLINA.                00076009
           IF WRK-TAXA LESS 0,70                                        00076105
             DISPLAY 'ABASTECA COM ALCOOL'                              00076205
             ELSE                                                       00076305
             DISPLAY 'ABASTECA COM GASOLINA'                            00076405
           END-IF.                                                      00076505
                                                                        00076604
           STOP RUN.                                                    00077002
                                                                        00077104
      *----------------------------------------------------------------*00078002
       0000-99-FIM.                    EXIT.                            00079002
      *----------------------------------------------------------------*00080002
                                                                        00080104
      *----------------------------------------------------------------*00081002
       9000-TRATAR-ERRO                SECTION.                         00082002
      *----------------------------------------------------------------*00083002
                                                                        00083104
      *----------------------------------------------------------------*00084002
       9000-99-FIM.                    EXIT.                            00085002
      *----------------------------------------------------------------*00086002
