       IDENTIFICATION                  DIVISION.                        00010000
       PROGRAM-ID. FR06CB05.                                            00020001
      *============================================================     00030000
      *     AUTOR   : JOEI LORENTI                                      00040000
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : 19/04/2022                                        00060000
      *     OBJETIVO:   CEBER DADOS DA SYSIN                            00070004
      *============================================================     00080000
      *ENVIRONMENT                      DIVISION.                       00081000
      *============================================================     00081105
      *============================================================*    00081205
       DATA                             DIVISION.                       00082000
      *=============================================================*   00082105
      *==============================================================*  00082205
       WORKING-STORAGE                  SECTION.                        00083000
      *=============================================================*   00083105
       77 WRK-VALOR       PIC 9(05)     VALUE ZEROS.                    00084000
       77 WRK-VALOR-COMP  PIC 9(05)     COMP   VALUE ZEROS.             00084100
      *==============================================================*  00084205
       PROCEDURE                        DIVISION.                       00084800
      *===============================================================* 00084905
           ACCEPT WRK-VALOR             FROM SYSIN.                     00085004
           MOVE   WRK-VALOR             TO WRK-VALOR-COMP.              00085105
           DISPLAY '-----------------------------------------'          00085205
           ADD 1                        TO WRK-VALOR-COMP.              00085304
           DISPLAY 'RESULTADO:...'         WRK-VALOR-COMP.              00086004
           DISPLAY '-----------------------------------------'          00087005
           STOP RUN.                                                    00087400
