      *================================================================*00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================J00003000
                                                                        00004000
       PROGRAM-ID.  FR06CB29.                                           00005000
                                                                        00006000
      *================================================================*00007000
      *     AUTOR.......: JOEI LORENTI                                  00008000
      *     ANALISTA....: IVAN SANCHES                                  00008100
      *     EMPRESA.....: FOURSYS                                       00009000
      *     DATA........: 02/05/2022                                    00020018
      *----------------------------------------------------------------*00020100
      *     OBJETIVO: ABERTURA E LEITURA DO ARQUIVO FUNC                00021000
      *               EXIBINDO RELATORIO DE CLIENTES                    00021104
      *                                                                 00021204
      *================================================================*00022000
                                                                        00023000
      *================================================================*00024000
       ENVIRONMENT                               DIVISION.              00025000
      *================================================================*00026000
                                                                        00026100
      *----------------------------------------------------------------*00026200
       CONFIGURATION                             SECTION.               00026300
      *----------------------------------------------------------------*00026400
                                                                        00026500
       SPECIAL-NAMES.                                                   00026600
           DECIMAL-POINT IS COMMA.                                      00026700
                                                                        00026800
      *----------------------------------------------------------------*00026900
       INPUT-OUTPUT                              SECTION.               00027000
      *----------------------------------------------------------------*00027100
                                                                        00027200
       FILE-CONTROL.                                                    00027300
             SELECT FUNC     ASSIGN TO JCLFUNC                          00027403
                FILE STATUS  IS WRK-FS-FUNC.                            00027500
                                                                        00027600
      *================================================================*00027700
       DATA                                      DIVISION.              00027800
      *================================================================*00027900
                                                                        00028000
      *----------------------------------------------------------------*00028100
       FILE                                      SECTION.               00028200
      *----------------------------------------------------------------*00028300
                                                                        00028400
       FD FUNC                                                          00028500
           RECORDING MODE IS F                                          00028600
           BLOCK CONTAINS 0 RECORDS.                                    00028700
                                                                        00028800
       01 FD-REGISTRO.                                                  00028900
          05 FD-CODIGO    PIC X(05).                                    00029000
          05 FD-NOME      PIC X(17).                                    00029100
          05 FD-FUNCAO    PIC X(15).                                    00029200
          05 FD-QTHORAS   PIC 9(03).                                    00029300
                                                                        00029400
      *----------------------------------------------------------------*00029500
       WORKING-STORAGE                           SECTION.               00029600
      *----------------------------------------------------------------*00029700
                                                                        00029800
       77 WRK-FS-FUNC   PIC X(02) VALUE SPACES.                         00029900
       77 WRK-MSG       PIC X(50) VALUE SPACES.                         00030000
       77 WRK-FIMARQ    PIC X(30) VALUE SPACES.                         00030116
                                                                        00030201
      *----------------------------------------------------------------*00030301
      *        AREA DE ACUMULADORES                                    *00030401
      *----------------------------------------------------------------*00030501
                                                                        00030600
       77 WRK-ACU-LIDOS PIC 9(02) VALUE ZEROS.                          00030701
       77 WRK-ANALISTA  PIC 9(02) VALUE ZEROS.                          00030805
                                                                        00030901
                                                                        00031001
                                                                        00031101
      *================================================================*00031200
       PROCEDURE DIVISION.                                              00031300
      *================================================================*00031400
                                                                        00031500
      *----------------------------------------------------------------*00031600
       0000-PRINCIPAL                     SECTION.                      00031700
      *----------------------------------------------------------------*00031800
                                                                        00031900
           PERFORM 0100-INICIAR.                                        00032000
           IF WRK-FS-FUNC EQUAL ZEROS                                   00032100
              PERFORM 0200-PROCESSAR UNTIL WRK-FS-FUNC EQUAL '10'       00032201
           END-IF.                                                      00032300
                                                                        00032410
           PERFORM 0210-RELATORIO.                                      00032510
                                                                        00032617
           PERFORM 9000-TRATAR-ERROS.                                   00032718
                                                                        00032810
           PERFORM 0300-FINALIZAR.                                      00032900
                                                                        00033010
           STOP RUN.                                                    00033100
                                                                        00033200
      *----------------------------------------------------------------*00033300
       0100-INICIAR                       SECTION.                      00033400
      *----------------------------------------------------------------*00033500
                                                                        00033600
            OPEN INPUT FUNC.                                            00033700
                IF WRK-FS-FUNC NOT EQUAL ZEROS                          00033800
                   MOVE ' STATUS NO OPEN ' TO WRK-MSG                   00033900
                     PERFORM 9000-TRATAR-ERROS                          00034000
                END-IF.                                                 00034100
                DISPLAY '   --------RELATORIO DE CLIENTES------------'. 00034210
                                                                        00034300
      *----------------------------------------------------------------*00034400
       0200-PROCESSAR                     SECTION.                      00034500
      *----------------------------------------------------------------*00034600
                                                                        00034700
                  READ FUNC.                                            00034800
               IF WRK-FS-FUNC NOT EQUAL ZEROS                           00034900
                    MOVE '- FINAL DE ARQUIVO   ' TO WRK-FIMARQ          00035016
                ELSE                                                    00035100
                 DISPLAY FD-REGISTRO                                    00035215
                      ADD 1              TO WRK-ACU-LIDOS               00035316
                   EVALUATE FD-FUNCAO                                   00035405
                      WHEN 'ANALISTA'                                   00035505
                      ADD 1              TO WRK-ANALISTA                00035616
                   END-EVALUATE                                         00035705
                END-IF.                                                 00035800
                                                                        00035907
      *----------------------------------------------------------------*00036010
       0210-RELATORIO                     SECTION.                      00036110
      *----------------------------------------------------------------*00036210
                                                                        00036310
                                                                        00036410
                DISPLAY '----------------------------------------------'00036607
                DISPLAY ' '                                             00036711
                DISPLAY 'TOTAL DE REGISTROS LIDOS - ' WRK-ACU-LIDOS.    00036810
                DISPLAY 'TOTAL DE REGISTROS ANALISTA - ' WRK-ANALISTA   00036910
                DISPLAY ' '                                             00037011
                DISPLAY '-----------------FIM DE RELATORIO------------' 00037112
                DISPLAY ' '.                                            00037212
                                                                        00037307
               IF WRK-FIMARQ NOT EQUAL SPACES                           00037416
                 DISPLAY WRK-FIMARQ                                     00037516
               END-IF.                                                  00037616
      *----------------------------------------------------------------*00037701
       0300-FINALIZAR                     SECTION.                      00037800
      *----------------------------------------------------------------*00037901
                                                                        00038001
            CLOSE FUNC.                                                 00038101
               IF WRK-FS-FUNC NOT EQUAL ZEROS                           00038200
                 MOVE ' STATUS NO CLOSE ' TO WRK-MSG                    00038300
                 PERFORM 9000-TRATAR-ERROS                              00038400
               END-IF.                                                  00038500
                                                                        00038600
      *----------------------------------------------------------------*00038700
       0000-99-FIM.            EXIT.                                    00038800
      *----------------------------------------------------------------*00038904
                                                                        00039000
      *----------------------------------------------------------------*00039104
       9000-TRATAR-ERROS                  SECTION.                      00039202
      *----------------------------------------------------------------*00039304
             DISPLAY '-------------------STATUS-----------------------'.00039404
             DISPLAY '  MENSAGEM        '  WRK-MSG.                     00039500
             DISPLAY '  FILE STATUS     '  WRK-FS-FUNC.                 00039600
             DISPLAY '------------------------------------------------'.00039704
      *----------------------------------------------------------------*00039804
       9000-99-FIM.            EXIT.                                    00040000
      *----------------------------------------------------------------*00050004
                                                                        00060000
