      *================================================================*00001004
       IDENTIFICATION                            DIVISION.              00002004
      *================================================================J00003004
                                                                        00004004
       PROGRAM-ID.  FR06CB30.                                           00005004
                                                                        00006004
      *================================================================*00007004
      *     AUTOR.......: JOEI LORENTI                                  00008004
      *     ANALISTA....: IVAN SANCHES                                  00008104
      *     EMPRESA.....: FOURSYS                                       00008204
      *     DATA........: 02/05/2022                                    00008304
      *----------------------------------------------------------------*00008404
      *     OBJETIVO: RECEBER ARQUIVO E  IMPRIMIR NA SYSOUT UM LAYOUT   00008504
      *               MENOR COM OS CAMPOS CODIGO, PRODUTO E FORNECEDOR. 00008604
      *                                                                 00008704
      *----------------------------------------------------------------*00008804
      *     INPUT:                                                      00008904
      *     DDNAME           I/O                                        00009004
      *    ARQPROD            I                                         00009104
      *                                                                 00009204
      *================================================================*00009304
                                                                        00009404
      *================================================================*00009504
       ENVIRONMENT                               DIVISION.              00009604
      *================================================================*00009704
                                                                        00009804
      *----------------------------------------------------------------*00009904
       CONFIGURATION                             SECTION.               00010004
      *----------------------------------------------------------------*00020004
                                                                        00021004
       SPECIAL-NAMES.                                                   00022004
           DECIMAL-POINT IS COMMA.                                      00023004
                                                                        00024004
      *----------------------------------------------------------------*00025004
       INPUT-OUTPUT                              SECTION.               00026004
      *----------------------------------------------------------------*00026104
                                                                        00026204
       FILE-CONTROL.                                                    00026304
             SELECT ARQPROD  ASSIGN TO JCLPROD                          00026404
                FILE STATUS  IS WRK-FS-PROD.                            00026504
                                                                        00026604
      *================================================================*00026704
       DATA                                      DIVISION.              00026804
      *================================================================*00026904
                                                                        00027004
      *----------------------------------------------------------------*00027104
       FILE                                      SECTION.               00027204
      *----------------------------------------------------------------*00027304
                                                                        00027404
       FD ARQPROD                                                       00027504
           RECORDING MODE IS F                                          00027604
           BLOCK CONTAINS 0 RECORDS.                                    00027704
                                                                        00027804
       01 FD-PROD.                                                      00027904
          05 FD-CODIGO                 PIC 9(05).                       00028004
          05 FD-PRODUTO                PIC X(20).                       00028104
          05 FD-FORNECEDOR             PIC X(15).                       00028204
          05 FD-VALOR                  PIC 9(08)V99.                    00028304
          05 FD-ESTOQUE                PIC 9(05).                       00028404
          05 FILLER                    PIC X(15).                       00028504
                                                                        00028604
      *----------------------------------------------------------------*00028704
       WORKING-STORAGE                           SECTION.               00028804
      *----------------------------------------------------------------*00028904
                                                                        00029004
       77 WRK-FS-PROD   PIC X(02) VALUE SPACES.                         00029104
       77 WRK-MSG       PIC X(50) VALUE SPACES.                         00029204
       77 WRK-FIMARQ    PIC X(30) VALUE SPACES.                         00029304
                                                                        00029404
      *----------------------------------------------------------------*00029504
      *                    AREA DE ACUMULADORES                        *00029604
      *----------------------------------------------------------------*00029704
                                                                        00029804
       77 WRK-ACU-LIDOS PIC 9(02) VALUE ZEROS.                          00029904
                                                                        00030004
      *----------------------------------------------------------------*00030104
      *                    AREA DE REDEFINES                           *00030204
      *----------------------------------------------------------------*00030304
      *01 FD-PROD-RDF                  REDEFINES FD-PROD.               00030406
      *   05 CODIGO                    PIC 9(05).                       00030506
      *   05 PRODUTO                   PIC X(20).                       00030606
      *   05 FORNECEDOR                PIC X(15).                       00030706
      *   05 FILLER                    PIC X(30) VALUE SPACES.          00030806
                                                                        00030904
       01 FD-PROD-ED                   PIC X(40) VALUE SPACES.          00031006
                                                                        00031104
      *================================================================*00031204
       PROCEDURE DIVISION.                                              00031304
      *================================================================*00031404
                                                                        00031504
      *----------------------------------------------------------------*00031604
       0000-PRINCIPAL                     SECTION.                      00031704
      *----------------------------------------------------------------*00031804
                                                                        00031904
           PERFORM 0100-INICIAR.                                        00032004
           IF WRK-FS-PROD EQUAL ZEROS                                   00032104
              PERFORM 0200-PROCESSAR UNTIL WRK-FS-PROD EQUAL '10'       00032204
           END-IF.                                                      00032304
                                                                        00032404
           PERFORM 0210-RELATORIO.                                      00032504
                                                                        00032604
           PERFORM 9000-TRATAR-ERROS.                                   00032704
                                                                        00032804
           PERFORM 0300-FINALIZAR.                                      00032904
                                                                        00033004
           STOP RUN.                                                    00033104
                                                                        00033204
      *----------------------------------------------------------------*00033304
       0100-INICIAR                       SECTION.                      00033404
      *----------------------------------------------------------------*00033504
                                                                        00033604
            OPEN INPUT ARQPROD                                          00033704
                IF WRK-FS-PROD NOT EQUAL ZEROS                          00033804
                   MOVE ' STATUS NO OPEN ' TO WRK-MSG                   00033904
                     PERFORM 9000-TRATAR-ERROS                          00034004
                END-IF.                                                 00034104
                                                                        00034204
      *----------------------------------------------------------------*00034304
       0200-PROCESSAR                     SECTION.                      00034404
      *----------------------------------------------------------------*00034504
                                                                        00034604
                  READ ARQPROD                                          00034704
               IF WRK-FS-PROD NOT EQUAL ZEROS                           00034804
                    MOVE '- FINAL DE ARQUIVO   ' TO WRK-FIMARQ          00034904
                ELSE                                                    00035004
                 DISPLAY FD-PROD                                        00035104
                      ADD 1              TO WRK-ACU-LIDOS               00035204
                      PERFORM 0220-EDITAR-ENTRADA                       00035304
               END-IF.                                                  00035404
                                                                        00035504
      *----------------------------------------------------------------*00035604
       0210-RELATORIO                     SECTION.                      00035704
      *----------------------------------------------------------------*00035804
                                                                        00035904
                                                                        00036004
                DISPLAY '----------------------------------------------'00036104
                DISPLAY ' '                                             00036204
                DISPLAY 'TOTAL DE REGISTROS LIDOS - ' WRK-ACU-LIDOS.    00036304
                DISPLAY ' '                                             00036404
                DISPLAY '-----------------FIM DE RELATORIO------------' 00036504
                DISPLAY ' '.                                            00036604
                                                                        00036704
               IF WRK-FIMARQ NOT EQUAL SPACES                           00036804
                 DISPLAY WRK-FIMARQ                                     00036904
               END-IF.                                                  00037004
                                                                        00037104
      *----------------------------------------------------------------*00037204
       0210-99-FIM.                    EXIT.                            00037304
      *----------------------------------------------------------------*00037404
      *----------------------------------------------------------------*00037504
       0220-EDITAR-ENTRADA             SECTION.                         00037604
      *----------------------------------------------------------------*00037704
                                                                        00037804
              MOVE FD-PROD TO FD-PROD-ED                                00037904
      *       DISPLAY ' ' FD-PROD-ED.                                   00038005
              DISPLAY ' ' FD-PROD-RDF.                                  00038105
                                                                        00038204
                                                                        00038304
                                                                        00038404
                                                                        00038504
                                                                        00038604
      *----------------------------------------------------------------*00038704
       0220-99-FIM.                    EXIT.                            00038804
      *----------------------------------------------------------------*00038904
                                                                        00039004
                                                                        00039104
                                                                        00039204
      *----------------------------------------------------------------*00039304
       0300-FINALIZAR                     SECTION.                      00039404
      *----------------------------------------------------------------*00039504
                                                                        00039604
            CLOSE ARQPROD.                                              00039704
               IF WRK-FS-PROD NOT EQUAL ZEROS                           00039804
                 MOVE ' STATUS NO CLOSE ' TO WRK-MSG                    00039904
                 PERFORM 9000-TRATAR-ERROS                              00040004
               END-IF.                                                  00040104
                                                                        00040204
      *----------------------------------------------------------------*00040304
       0300-99-FIM.            EXIT.                                    00040404
      *----------------------------------------------------------------*00040504
                                                                        00040604
      *----------------------------------------------------------------*00040704
       9000-TRATAR-ERROS                  SECTION.                      00040804
      *----------------------------------------------------------------*00040904
             DISPLAY '-------------------STATUS-----------------------'.00041004
             DISPLAY '  MENSAGEM        '  WRK-MSG.                     00041104
             DISPLAY '  FILE STATUS     '  WRK-FS-PROD.                 00041204
             DISPLAY '------------------------------------------------'.00041304
      *----------------------------------------------------------------*00041404
       9000-99-FIM.            EXIT.                                    00041504
      *----------------------------------------------------------------*00041604
                                                                        00041704
