      *================================================================*00001007
       IDENTIFICATION                  DIVISION.                        00010000
      *================================================================*00011007
                                                                        00020007
       PROGRAM-ID. FR06CB21.                                            00021008
                                                                        00022007
      *================================================================*00030000
      *                                                                 00041007
      *     AUTOR   : JOEI LORENTI                                      00042007
      *     EMPRESA : FOURSYS                                           00050000
      *     DATA    : 24/04/2022                                        00060000
      *                                                                 00061009
      *----------------------------------------------------------------*00062009
      *                                                                 00063009
      *     OBJETIVO: RECEBER VIA SYSIN NAS NAS VARIAVEIS WRK-SALARIO   00070000
      *               E WRK-INDICE, MULTIPLICAR SALÁRIO PELO INDICE     00071000
      *               GERAR NA SYSOUT O VALOR DO SALARIO, INDICE E      00071100
      *               SAL-CORRIGIDO.                                    00071207
      *                                                                 00071307
      *================================================================*00071400
       ENVIRONMENT                      DIVISION.                       00071509
      *================================================================*00071600
                                                                        00071707
      *================================================================*00071800
       DATA                             DIVISION.                       00071900
      *================================================================*00072000
                                                                        00072107
      *----------------------------------------------------------------*00072207
       WORKING-STORAGE                  SECTION.                        00072300
      *----------------------------------------------------------------*00072407
                                                                        00073107
       01 WRK-REGISTRO.                                                 00073207
          05 WRK-SALARIO       PIC 9(06)V99     VALUE ZEROS.            00074006
          05 WRK-INDICE        PIC 9(03)        VALUE ZEROS.            00075000
       77 WRK-SALCORRIGIDO     PIC 9(06)V99     VALUE ZEROS.            00076006
       77 WRK-CORRECAO         PIC 9(06)V99     VALUE ZEROS.            00077007
                                                                        00077107
      *================================================================*00078000
       PROCEDURE                        DIVISION.                       00079000
      *================================================================*00080000
                                                                        00080107
      *----------------------------------------------------------------*00080207
       0000-PRINCIPAL                   SECTION.                        00080307
      *----------------------------------------------------------------*00080407
                                                                        00080507
           ACCEPT WRK-REGISTRO     FROM SYSIN.                          00080600
                                                                        00080707
      *---------------------REGRA USANDO MULT E ADD--------------------*00080807
      *                                                                 00080909
      *    MULTIPLY WRK-SALARIO BY WRK-INDICE                           00081007
      *                            GIVING WRK-CORRECAO.                 00081107
      *    ADD WRK-SALARIO WRK-CORRECAO                                 00081207
      *                            GIVING WRK-SALCORRIGIDO              00081307
      *                                                                 00081409
      *-----------------------------------------------------------------00081507
                                                                        00081607
           COMPUTE WRK-SALCORRIGIDO = WRK-SALARIO + WRK-SALARIO         00081707
                                             * WRK-INDICE / 100.        00081807
                                                                        00081907
                DISPLAY '--------------------------------------------'  00082000
                DISPLAY 'VALOR SALARIO....: ' WRK-SALARIO.              00082100
                DISPLAY 'INDICE...........: ' WRK-INDICE.               00082200
                DISPLAY 'SALARIO CORRIGIDO: ' WRK-SALCORRIGIDO.         00082300
                DISPLAY '--------------------------------------------'. 00082400
                                                                        00082507
           STOP RUN.                                                    00083000
                                                                        00083109
      *----------------------------------------------------------------*00084007
       0000-99-FIM.                    EXIT.                            00085007
      *----------------------------------------------------------------*00086007
                                                                        00086109
      *----------------------------------------------------------------*00087007
       9000-TRATAR-ERRO                SECTION.                         00088007
      *----------------------------------------------------------------*00089007
                                                                        00089109
      *----------------------------------------------------------------*00090007
       9000-99-FIM.                    EXIT.                            00100007
      *----------------------------------------------------------------*00110007
