      *================================================================*00001000
       IDENTIFICATION                  DIVISION.                        00002000
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID. FR06CB23.                                            00005004
                                                                        00006000
      *================================================================*00007000
      *                                                                 00008000
      *     AUTOR   : JOEI LORENTI                                      00009000
      *     EMPRESA : FOURSYS                                           00010000
      *     DATA    : 26/04/2022                                        00020001
      *                                                                 00021000
      *----------------------------------------------------------------*00022000
      *                                                                 00031000
      *     OBJETIVO: RECEBER NAS VARIAVEIS WRK-CODIGO, WRK-PRODUTO,    00032000
      *               WRK-VALOR, WRK-ESTADO E DE ACORDO COM A REGIAO    00040000
      *               CALCULAR O FRETE.                                 00050000
      *               SP - 10%                                          00060000
      *               RJ - 15%                                          00070000
      *               MG - 20%                                          00070100
      *               SÓ SERAO ENTREGUES PRODUTOS ACIMA DE 1000,        00070200
      *               CASO CONTRARIO O CLIENTE RETIRA NA LOJA.          00070300
      *                                                                 00070400
      *================================================================*00071000
       ENVIRONMENT                      DIVISION.                       00071100
      *================================================================*00071200
                                                                        00071300
      *----------------------------------------------------------------*00071400
       CONFIGURATION                    SECTION.                        00071500
      *----------------------------------------------------------------*00071600
       SPECIAL-NAMES.                                                   00071700
           DECIMAL-POINT IS COMMA.                                      00071800
      *================================================================*00071900
       DATA                             DIVISION.                       00072000
      *================================================================*00072100
                                                                        00072200
      *----------------------------------------------------------------*00072300
       WORKING-STORAGE                  SECTION.                        00072400
      *----------------------------------------------------------------*00072500
                                                                        00072600
       01 WRK-REGISTRO.                                                 00072700
          05 WRK-CODIGO                PIC 9(05)        VALUE ZEROS.    00072800
          05 WRK-PRODUTO               PIC X(15)        VALUE SPACES.   00072902
          05 WRK-VALOR                 PIC 9(08)V99     VALUE ZEROS.    00073000
          05 WRK-ESTADO                PIC X(02)        VALUE SPACES.   00073100
       77 WRK-FRETE                    PIC 9(08)V99     VALUE ZEROS.    00073200
       77 WRK-MENSAGEM                 PIC X(45)        VALUE SPACES.   00073405
                                                                        00073501
      *================================================================*00073600
       PROCEDURE                        DIVISION.                       00073700
      *================================================================*00073800
                                                                        00073900
      *----------------------------------------------------------------*00074000
       0000-PRINCIPAL                   SECTION.                        00074100
      *----------------------------------------------------------------*00074200
                                                                        00074300
           ACCEPT WRK-REGISTRO     FROM SYSIN.                          00075000
           IF WRK-VALOR GREATER THAN OR EQUAL 1000                      00076000
               IF WRK-ESTADO = 'SP'                                     00076100
                COMPUTE WRK-FRETE = WRK-VALOR * 0,10                    00076201
               END-IF                                                   00076300
               IF WRK-ESTADO = 'RJ'                                     00076400
                COMPUTE WRK-FRETE = WRK-VALOR * 0,15                    00076501
               END-IF                                                   00076600
               IF WRK-ESTADO = 'MG'                                     00077100
                COMPUTE WRK-FRETE = WRK-VALOR * 0,20                    00077201
               END-IF                                                   00077300
                                                                        00077702
           ELSE                                                         00077801
               MOVE 'RETIRADA NA LOJA'  TO WRK-MENSAGEM                 00077902
           END-IF.                                                      00078001
                                                                        00078202
                                                                        00078302
            DISPLAY 'CODIGO......' WRK-CODIGO.                          00078402
            DISPLAY 'PRODUTO.... ' WRK-PRODUTO.                         00078502
            DISPLAY 'VALOR...... ' WRK-VALOR.                           00078601
            DISPLAY 'ESTADO......' WRK-ESTADO.                          00078702
                                                                        00078802
           IF WRK-MENSAGEM              NOT EQUAL SPACES                00078903
                                       DISPLAY WRK-MENSAGEM             00079002
           END-IF.                                                      00079102
           IF WRK-FRETE                NOT EQUAL ZEROS                  00079202
             DISPLAY 'VALOR DO FRETE ' WRK-FRETE                        00079302
           END-IF.                                                      00079402
                                                                        00079502
           STOP RUN.                                                    00079600
      *----------------------------------------------------------------*00079700
       0000-99-FIM.                    EXIT.                            00079800
      *----------------------------------------------------------------*00080000
      *----------------------------------------------------------------*00081000
       9000-TRATAR-ERRO                SECTION.                         00082000
      *----------------------------------------------------------------*00083000
      *----------------------------------------------------------------*00084000
       9000-99-FIM.                    EXIT.                            00085000
      *----------------------------------------------------------------*00086000
