      *================================================================*00001000
       IDENTIFICATION                  DIVISION.                        00002000
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID. FR06CB24.                                            00005000
                                                                        00006000
      *================================================================*00007000
      *                                                                 00008000
      *     AUTOR   : JOEI LORENTI                                      00009000
      *     EMPRESA : FOURSYS                                           00010000
      *     DATA    : 27/04/2022                                        00020000
      *                                                                 00021000
      *----------------------------------------------------------------*00022000
      *                                                                 00023000
      *     OBJETIVO: RECEBER NAS VARIAVEIS WRK-CODIGO, WRK-PRODUTO,    00024000
      *               WRK-VALOR, WRK-ESTADO E DE ACORDO COM A REGIAO    00025000
      *               CALCULAR O FRETE.                                 00026000
      *               SP - 10%                                          00027000
      *               RJ - 15%                                          00028000
      *               MG - 20%                                          00029000
      *               SO SERAO ENTREGUES PRODUTOS ACIMA DE 1000,        00030000
      *               CASO CONTRARIO O CLIENTE RETIRA NA LOJA.          00040000
      *               COMANDO EVALUATE.                                 00050000
      *================================================================*00060000
       ENVIRONMENT                      DIVISION.                       00070000
      *================================================================*00071000
                                                                        00071100
      *----------------------------------------------------------------*00071200
       CONFIGURATION                    SECTION.                        00071300
      *----------------------------------------------------------------*00071400
       SPECIAL-NAMES.                                                   00071500
           DECIMAL-POINT IS COMMA.                                      00071600
      *================================================================*00071700
       DATA                             DIVISION.                       00071800
      *================================================================*00071900
                                                                        00072000
      *----------------------------------------------------------------*00072100
       WORKING-STORAGE                  SECTION.                        00072200
      *----------------------------------------------------------------*00072300
                                                                        00072400
       01 WRK-REGISTRO.                                                 00072500
          05 WRK-CODIGO                PIC 9(05)        VALUE ZEROS.    00072600
          05 WRK-PRODUTO               PIC X(15)        VALUE SPACES.   00072700
          05 WRK-VALOR                 PIC 9(08)V99     VALUE ZEROS.    00072800
          05 WRK-ESTADO                PIC X(02)        VALUE SPACES.   00072900
       77 WRK-FRETE                    PIC 9(08)V99     VALUE ZEROS.    00073000
       77 WRK-MENSAGEM                 PIC X(45)        VALUE SPACES.   00073100
                                                                        00073200
      *================================================================*00073300
       PROCEDURE                        DIVISION.                       00073400
      *================================================================*00073500
                                                                        00073600
      *----------------------------------------------------------------*00073700
       0000-PRINCIPAL                   SECTION.                        00073800
      *----------------------------------------------------------------*00073900
                                                                        00074000
           ACCEPT WRK-REGISTRO     FROM SYSIN.                          00075000
                                                                        00075100
           IF WRK-VALOR GREATER THAN OR EQUAL 1000                      00075200
               EVALUATE WRK-ESTADO                                      00076000
               WHEN 'SP'                                                00076100
                 COMPUTE WRK-FRETE = WRK-VALOR * 0,10                   00076200
               WHEN 'RJ'                                                00076400
                 COMPUTE WRK-FRETE = WRK-VALOR * 0,15                   00076500
               WHEN 'MG'                                                00076700
                 COMPUTE WRK-FRETE = WRK-VALOR * 0,20                   00076800
               WHEN OTHER                                               00076900
                 MOVE '***ENTREGA NAO DISPONIVEL PARA ESSA UF***'       00077001
                     TO WRK-MENSAGEM                                    00077100
           END-EVALUATE                                                 00077200
           ELSE                                                         00077300
               MOVE 'RETIRADA NA LOJA'  TO WRK-MENSAGEM                 00077400
           END-IF.                                                      00077500
                                                                        00077600
                                                                        00077700
            DISPLAY 'CODIGO......' WRK-CODIGO.                          00077800
            DISPLAY 'PRODUTO.... ' WRK-PRODUTO.                         00077900
            DISPLAY 'VALOR...... ' WRK-VALOR.                           00078000
            DISPLAY 'ESTADO......' WRK-ESTADO.                          00078100
                                                                        00078200
           IF WRK-MENSAGEM              NOT EQUAL SPACES                00078300
                                       DISPLAY WRK-MENSAGEM             00078400
           END-IF.                                                      00078500
           IF WRK-FRETE                NOT EQUAL ZEROS                  00078600
             DISPLAY 'VALOR DO FRETE ' WRK-FRETE                        00078700
           END-IF.                                                      00078800
                                                                        00078900
           STOP RUN.                                                    00079000
      *----------------------------------------------------------------*00079100
       0000-99-FIM.                    EXIT.                            00079200
      *----------------------------------------------------------------*00080000
      *----------------------------------------------------------------*00081000
       9000-TRATAR-ERRO                SECTION.                         00082000
      *----------------------------------------------------------------*00083000
      *----------------------------------------------------------------*00084000
       9000-99-FIM.                    EXIT.                            00085000
      *----------------------------------------------------------------*00086000
