      *================================================================J00001000
       IDENTIFICATION                            DIVISION.              00002000
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID.  FR02DB12.                                           00005000
                                                                        00006000
      *================================================================*00007000
      *                        TREINAMENTO                             *00008000
      *================================================================*00009000
      *     AUTOR.......: JOEI LORENTI                                 *00020000
      *     ANALISTA....: IVAN SANCHES                                 *00021000
      *     EMPRESA.....: FOURSYS                                      *00022000
      *     DATA........: 10/06/2022                                   *00023000
      *----------------------------------------------------------------*00024000
      *     OBJETIVO....: LER REGISTROS DE DUAS TABELAS E GRAVAR EM UM *00025000
      *                   ARQUIVO DE SAIDA                             *00026000
      *----------------------------------------------------------------*00027000
      *     ARQUIVOS....:                                              *00028000
      *       DDNAME               I/O                 INCLUDE/BOOK    *00029000
      *       DB2                   O                    B#DB2         *00029102
      *----------------------------------------------------------------*00029200
      *     BASE DE DADOS:                                             *00029300
      *       DDNAME               I/O                 INCLUDE/BOOK    *00029400
      *       FOUR002.SETOR         I                    #SETOR        *00029500
      *       FOUR001.FUNC          I                    BOOKFUNC      *00029500
      *----------------------------------------------------------------*00030000
      *     MODULOS.....:                                              *00040000
      *       B#GRVLG2                                                 *00050000
      *================================================================*00060000
                                                                        00070000
      *================================================================*00070100
       ENVIRONMENT                               DIVISION.              00070200
      *================================================================*00070300
                                                                        00070400
      *----------------------------------------------------------------*00070500
       CONFIGURATION                             SECTION.               00070600
      *----------------------------------------------------------------*00070700
                                                                        00070800
       SPECIAL-NAMES.                                                   00070900
           DECIMAL-POINT                         IS COMMA.              00071000
                                                                        00071100
      *----------------------------------------------------------------*00071200
       INPUT-OUTPUT                              SECTION.               00071300
      *----------------------------------------------------------------*00071400
                                                                        00071500
       FILE-CONTROL.                                                    00071600
                                                                        00071700
            SELECT RELSET ASSIGN                    TO RELSET           00071802
                   FILE STATUS IS WRK-FS-RELSET.                        00071902
                                                                        00072000
      *================================================================*00072100
       DATA                                      DIVISION.              00072200
      *================================================================*00072300
                                                                        00072400
      *----------------------------------------------------------------*00072500
       FILE                                      SECTION.               00072600
      *----------------------------------------------------------------*00072700
                                                                        00072800
       FD RELSET                                                        00072902
                                                                        00073000
           RECORDING MODE IS F                                          00073100
           LABEL RECORD IS STANDARD                                     00073200
           BLOCK CONTAINS 0 RECORDS.                                    00073300
                                                                        00073400
       01 FD-RELSET.                                                    00073502
          05 FD-RELSET-ID               PIC 9(04).                      00073600
          05 FD-RELSET-NOME             PIC X(30).                      00073600
          05 FD-RELSET-EMAIL            PIC X(40).                      00073600
          05 FD-RELSET-SALARIO          PIC 9(10).                      00073600
          05 FD-RELSET-DESCSETOR        PIC X(40).                      00073600
                                                                        00073600
      *----------------------------------------------------------------*00073700
                                                                        00073800
      *----------------------------------------------------------------*00073900
       WORKING-STORAGE                           SECTION.               00074000
      *----------------------------------------------------------------*00074100
                                                                        00074200
      *----------------------------------------------------------------*00074300
       01 FILLER                                  PIC X(050)    VALUE   00074400
             '*** AREA DE VARIAVEIS DE FILE STATUS ***'.                00074500
      *----------------------------------------------------------------*00074600
                                                                        00074700
       77 WRK-FS-RELSET                           PIC 9(02).            00074802
                                                                        00074900
      *----------------------------------------------------------------*00075000
       01 FILLER                                  PIC X(050)    VALUE   00075100
             '*** AREA DE VARIAVEIS AUXILIARES ***'.                    00075200
      *----------------------------------------------------------------*00075300
                                                                        00075400
       77 WRK-EMAIL-NULL                PIC  S9(04)    COMP VALUE ZEROS.00075700
       77 WRK-ACUM-LIDOS                PIC   9(02)    VALUE ZEROS.     00075807
       77 WRK-ACUM-GRAVS                PIC   9(02)    VALUE ZEROS.     00075907
       77 WRK-SOMA-SALR                 PIC   9(10)    VALUE ZEROS.     00076008
                                                                        00076200
      *----------------------------------------------------------------*00076300
                                                                        00076400
      *----------------------------------------------------------------*00076500
       01 FILLER                                  PIC X(050)    VALUE   00076600
             '*** AREA DO ARQUIVO DB2 ***'.                             00076702
      *----------------------------------------------------------------*00076800
                                                                        00076900
          COPY '#BRELSET'.                                              00077002
                                                                        00077100
      *----------------------------------------------------------------*00077200
                                                                        00077300
      *----------------------------------------------------------------*00077400
       01 FILLER                                  PIC X(050)    VALUE   00077500
             '*** AREA DO ARQUIVO LOGERRO2 ***'.                        00077600
      *----------------------------------------------------------------*00077700
                                                                        00077800
          COPY 'B#GRVLG2'.                                              00077900
                                                                        00078000
      *----------------------------------------------------------------*00078300
       01 FILLER                                  PIC X(050)    VALUE   00078400
             '*** AREA DE DB2 ***'.                                     00078500
      *----------------------------------------------------------------*00078600
                                                                        00078700
           EXEC SQL                                                     00078800
              INCLUDE BOOKFUNC                                          00078900
           END-EXEC.                                                    00079000
                                                                        00079100
           EXEC SQL                                                     00079200
              INCLUDE #SETOR                                            00079300
           END-EXEC.                                                    00079400
                                                                        00079500
           EXEC SQL                                                     00079600
              INCLUDE SQLCA                                             00079700
           END-EXEC.                                                    00079800
                                                                        00079900
           EXEC SQL                                                     00080000
              DECLARE CFUNC CURSOR FOR                                  00080100
              SELECT ID,NOME,EMAIL,SALARIO,DESCSETOR                    00080200
               FROM FOUR001.FUNC F, FOUR001.SETOR S                     00080300
               WHERE F.SETOR = S.IDSETOR                                00080400
                WITH UR                                                 00080500
           END-EXEC.                                                    00080600
                                                                        00080700
      *----------------------------------------------------------------*00080800
                                                                        00080900
      *================================================================*00081000
       PROCEDURE                                 DIVISION.              00081100
      *================================================================*00081200
                                                                        00081300
      *----------------------------------------------------------------*00081400
       0000-PRINCIPAL                            SECTION.               00081500
      *----------------------------------------------------------------*00081600
                                                                        00081700
            PERFORM 1000-INICIAR.                                       00081800
            PERFORM 2000-PROCESSAR UNTIL SQLCODE EQUAL 100.             00081900
            PERFORM 3000-FINALIZAR.                                     00082000
            STOP RUN.                                                   00082100
                                                                        00082200
      *----------------------------------------------------------------*00082300
       0000-99-FIM.                             EXIT.                   00082400
      *----------------------------------------------------------------*00082500
                                                                        00082600
      *----------------------------------------------------------------*00082700
       1000-INICIAR                              SECTION.               00082800
      *----------------------------------------------------------------*00082900
                                                                        00083000
            EXEC SQL                                                    00083100
               OPEN CFUNC                                               00083200
            END-EXEC.                                                   00083300
                                                                        00083400
             IF(SQLCODE NOT EQUAL ZEROS            AND +100) OR         00083500
               (SQLWARN0                           EQUAL 'W')           00083600
                                                                        00083700
             MOVE 'FR06DB12'                       TO WRK-PROGRAMA      00083800
             MOVE '1000'                           TO WRK-SECAO         00083900
             MOVE 'ERRO NA ABERTURA DO CURSOR'     TO WRK-MENSAGEM      00084000
             MOVE WRK-FS-RELSET                    TO WRK-STATUS        00084102
             MOVE SQLCODE                          TO WRK-SQLCODE       00084200
             PERFORM 9000-TRATAR-ERRO                                   00084300
                                                                        00084400
             ELSE                                                       00084500
              PERFORM 2100-LER-FUNCIONARIO                              00084600
             END-IF.                                                    00084700
                                                                        00084800
             IF(SQLCODE                            EQUAL +100)          00084900
             MOVE 'FR06DB12'                       TO WRK-PROGRAMA      00085000
             MOVE '1000'                           TO WRK-SECAO         00085100
             MOVE 'ARQUIVO VAZIO'                  TO WRK-MENSAGEM      00085200
             MOVE WRK-FS-RELSET                    TO WRK-STATUS        00085302
             MOVE SQLCODE                          TO WRK-SQLCODE       00085400
             PERFORM 9000-TRATAR-ERRO                                   00085500
             END-IF.                                                    00085600
                                                                        00085700
                                                                        00085800
            OPEN OUTPUT RELSET.                                         00085902
            PERFORM 1100-TESTAR-FS-RELSET.                              00086002
                                                                        00086100
      *----------------------------------------------------------------*00086200
       1000-99-FIM.                             EXIT.                   00086300
      *----------------------------------------------------------------*00086400
                                                                        00086500
      *----------------------------------------------------------------*00086600
       1100-TESTAR-FS-RELSET                     SECTION.               00086702
      *----------------------------------------------------------------*00086800
                                                                        00086900
            PERFORM 1110-TESTAR-FS-ABERTURA.                            00087000
                                                                        00087100
      *----------------------------------------------------------------*00087200
       1100-99-FIM.                             EXIT.                   00087300
      *----------------------------------------------------------------*00087400
                                                                        00087500
      *----------------------------------------------------------------*00087600
       1110-TESTAR-FS-ABERTURA                   SECTION.               00087700
      *----------------------------------------------------------------*00087800
                                                                        00087900
           IF WRK-FS-RELSET                       NOT EQUAL ZEROS       00088002
                                                                        00088100
            MOVE 'FR02DB12'                       TO WRK-PROGRAMA       00088200
            MOVE '1000'                           TO WRK-SECAO          00088300
            MOVE 'ERRO NA ABERTURA DO RELDB02'    TO WRK-MENSAGEM       00088400
            MOVE '35'                             TO WRK-STATUS         00088500
            PERFORM 9000-TRATAR-ERRO                                    00088600
                                                                        00088700
           END-IF.                                                      00088800
                                                                        00088900
      *----------------------------------------------------------------*00089000
       1110-99-FIM.                             EXIT.                   00089100
      *----------------------------------------------------------------*00089200
                                                                        00089300
      *----------------------------------------------------------------*00089400
       2000-PROCESSAR                            SECTION.               00089500
      *----------------------------------------------------------------*00089600
                                                                        00089700
                IF WRK-EMAIL-NULL = -1                                  00089802
                                                                        00089902
                   MOVE SPACES         TO DB2-EMAIL                     00090002
                END-IF.                                                 00090202
                                                                        00090302
               MOVE DB2-ID             TO FD-RELSET-ID                  00090402
               MOVE DB2-NOME           TO FD-RELSET-NOME                00090502
               MOVE DB2-EMAIL          TO FD-RELSET-EMAIL               00090602
               MOVE DB2-SALARIO        TO FD-RELSET-SALARIO             00090702
               MOVE DB2-DESCSETOR      TO FD-RELSET-DESCSETOR.          00090802
                                                                        00090901
                                                                        00091100
                WRITE FD-RELSET.                                        00091202
                ADD 1                  TO WRK-ACUM-LIDOS.               00091307
                ADD 1                  TO WRK-ACUM-GRAVADOS.            00091407
                PERFORM 2100-LER-FUNCIONARIO.                           00091507
                                                                        00091607
      *----------------------------------------------------------------*00091707
       2000-99-FIM.                             EXIT.                   00091807
      *----------------------------------------------------------------*00091907
                                                                        00092007
      *----------------------------------------------------------------*00092107
       2100-LER-FUNCIONARIO                      SECTION.               00092207
      *----------------------------------------------------------------*00092307
                                                                        00092407
           EXEC SQL                                                     00092507
             FETCH CFUNC                                                00092607
              INTO :DB2-ID,                                             00092707
                   :DB2-NOME,                                           00092807
                   :DB2-EMAIL :WRK-EMAIL-NULL,                          00092907
                   :DB2-SALARIO,                                        00093007
                   :DB2-DESCSETOR                                       00093107
            END-EXEC.                                                   00093200
                                                                        00093300
              IF (SQLCODE                          EQUAL +100)          00093400
                                                                        00093500
                DISPLAY '-FINAL DE ARQUIVO-'                            00094106
                 PERFORM 4000-EMITIR-TOTAIS                             00094207
                                                                        00094300
              END-IF.                                                   00094400
                                                                        00094500
              IF(SQLCODE              NOT EQUAL ZEROS AND +100) OR      00094600
                (SQLWARN0                          EQUAL 'W')           00094700
                                                                        00094800
               MOVE 'FR02DB12'                     TO WRK-PROGRAMA      00094900
               MOVE '2100'                         TO WRK-SECAO         00095000
               MOVE 'ERRO NA LEITURA DA TABELA'    TO WRK-MENSAGEM      00095103
               MOVE SQLCODE                        TO WRK-SQLCODE       00095200
               MOVE WRK-FS-RELSET                  TO WRK-STATUS        00095302
               PERFORM 9000-TRATAR-ERRO                                 00095400
                                                                        00095500
              END-IF.                                                   00095600
                                                                        00095700
      *----------------------------------------------------------------*00095800
       2100-99-FIM.                             EXIT.                   00095900
      *----------------------------------------------------------------*00096000
                                                                        00097000
                                                                        00098000
      *----------------------------------------------------------------*00098100
       3000-FINALIZAR                            SECTION.               00098200
      *----------------------------------------------------------------*00098300
                                                                        00098400
                                                                        00099200
            EXEC SQL                                                    00099300
             CLOSE CFUNC                                                00099400
            END-EXEC.                                                   00099500
                                                                        00099600
            CLOSE RELSET.                                               00099702
                                                                        00099804
                                                                        00100004
      *----------------------------------------------------------------*00100100
       3000-99-FIM.                             EXIT.                   00100200
      *----------------------------------------------------------------*00100300
      *----------------------------------------------------------------*00100407
       4000-EMITIR-TOTAIS                       SECTION.                00100507
      *----------------------------------------------------------------*00100607
                                                                        00100707
           DISPLAY '******************FR02DB12************************'.00100807
           DISPLAY '*                                                *'.00100907
           DISPLAY '*         FR02DB02 - PROCESSAMENTO OK!           *'.00101007
           DISPLAY '*                                                *'.00101107
           DISPLAY '* TOTAIS PROCESSADOS:                            *'.00101207
           DISPLAY '*                                                *'.00101307
           DISPLAY '* REGISTROS LIDOS...: ' WRK-ACUM-LIDOS '         *'.00101407
           DISPLAY '*                                                *'.00101507
           DISPLAY '* REGISTROS GRAVADOS: ' WRK-ACUM-GRAVS '         *'.00101607
           DISPLAY '*                                                *'.00101707
           DISPLAY '******************FR02DB12************************'.00101807
                                                                        00101907
      *----------------------------------------------------------------*00102007
       4000-99-FIM.                             EXIT.                   00102107
      *----------------------------------------------------------------*00102207
      *----------------------------------------------------------------*00102300
       9000-TRATAR-ERRO                          SECTION.               00102400
      *----------------------------------------------------------------*00102500
                                                                        00102600
             CALL 'GRVLOG2' USING WRK-LOG.                              00102700

             GOBACK.                                                    00102800
                                                                        00102900
      *----------------------------------------------------------------*00103000
       9000-99-FIM.                             EXIT.                   00104000
      *----------------------------------------------------------------*00110000
