      *================================================================J00001004
       IDENTIFICATION                  DIVISION.                        00002001
      *================================================================*00003001
                                                                        00004001
       PROGRAM-ID. FR06BASE.                                            00005001
                                                                        00006001
      *================================================================*00007001
      *                                                                 00008001
      *     AUTOR.......: JOEI LORENTI                                  00009004
      *     ANALISTA....: IVAN SANCHES                                  00009104
      *     EMPRESA.....: FOURSYS                                       00010004
      *     DATA........: ZZ/ZZ/ZZZZ                                    00020004
      *     OBJETIVO....: DESCREVER O QUE O PROGRAMA FAZ.               00030004
      *                                                                 00040001
      *                                                                 00050001
      *                                                                 00060001
      *                                                                 00070001
      *================================================================*00071001
       ENVIRONMENT                      DIVISION.                       00071102
      *================================================================*00071201
                                                                        00071301
      *----------------------------------------------------------------*00071401
       CONFIGURATION                    SECTION.                        00071501
      *----------------------------------------------------------------*00071601
                                                                        00071704
       SPECIAL-NAMES.                                                   00071801
           DECIMAL-POINT IS COMMA.                                      00071903
                                                                        00072004
      *================================================================*00072101
       DATA                             DIVISION.                       00072201
      *================================================================*00072301
                                                                        00072401
      *----------------------------------------------------------------J00072504
       WORKING-STORAGE                  SECTION.                        00072601
      *----------------------------------------------------------------*00072701
                                                                        00073001
      *01 WRK-REGISTRO.                                                 00073103
      *   05 WRK-                      PIC 9(06)V99     VALUE ZEROS.    00073203
      *   05 WRK-                      PIC 9(03)        VALUE ZEROS.    00073303
      *77 WRK-                         PIC 9(06)V99     VALUE ZEROS.    00073403
      *77 WRK-                         PIC 9(06)V99     VALUE ZEROS.    00073503
                                                                        00073601
      *================================================================*00073701
       PROCEDURE                        DIVISION.                       00073801
      *================================================================*00073901
                                                                        00074001
      *----------------------------------------------------------------*00075001
       0000-PRINCIPAL                   SECTION.                        00076003
      *----------------------------------------------------------------*00077001
                                                                        00077105
           PERFORM 0100-INICIAR.                                        00077205
                                                                        00077305
           PERFORM 0200-PROCESSAR.                                      00077405
                                                                        00077505
           PERFORM 0300-FINALIZAR.                                      00077605
                                                                        00077705
           STOP RUN.                                                    00077805
                                                                        00077905
      *----------------------------------------------------------------*00078105
       0000-99-FIM.                    EXIT.                            00078205
      *----------------------------------------------------------------*00078305
                                                                        00078401
      *----------------------------------------------------------------*00078505
       0100-INICIAR                    SECTION.                         00078605
      *----------------------------------------------------------------*00078705
           ACCEPT WRK-REGISTRO     FROM SYSIN.                          00079005
      *----------------------------------------------------------------*00082001
       0100-99-FIM.                    EXIT.                            00083005
      *----------------------------------------------------------------*00084001
                                                                        00084105
      *----------------------------------------------------------------*00084205
       0200-PROCESSAR                  SECTION.                         00084305
      *----------------------------------------------------------------*00084405
                                                                        00084505
           MOVE 'PGM-BASE'             TO WRK-BASE                      00084605
                                                                        00084705
      *----------------------------------------------------------------*00084805
       0200-99-FIM.                    EXIT.                            00084905
      *----------------------------------------------------------------*00085005
                                                                        00085105
      *----------------------------------------------------------------*00085205
       0300-FINALIZAR                  SECTION.                         00085305
      *----------------------------------------------------------------*00085405
                                                                        00085505
            DISPLAY WRK-BASE                                            00085605
                                                                        00085705
      *----------------------------------------------------------------*00085805
       0300-99-FIM.                    EXIT.                            00085905
      *----------------------------------------------------------------*00086005
      *----------------------------------------------------------------*00086101
       9000-TRATAR-ERRO                SECTION.                         00086201
      *----------------------------------------------------------------*00087001
      *----------------------------------------------------------------*00088001
       9000-99-FIM.                    EXIT.                            00089001
      *----------------------------------------------------------------*00090001
