      *================================================================J00001005
       IDENTIFICATION                            DIVISION.              00002005
      *================================================================*00003005
                                                                        00004005
       PROGRAM-ID.  F06CIP3.                                            00005005
                                                                        00006005
      *================================================================*00007005
      *                        TREINAMENTO                             *00008005
      *================================================================*00009005
      *     PROGRAMA....: F06CI03                                      *00010005
      *     PROGRAMADOR.: JOEI LORENTI                                 *00020005
      *     ANALISTA....: IVAN SANCHES                                 *00030005
      *     DATA........: 30/06/2022                                   *00040005
      *----------------------------------------------------------------*00050005
      *     OBJETIVO....: PROGRAMA QUE RECEBE TRANSACAO E ID VIA CICS  *00070012
      *                   E DEVOLVE REGISTRO CORRESPONDENTE DE UM ARQ  *00070112
      *                   VSAM                                         *00070205
      *----------------------------------------------------------------*00070305
      *     ARQUIVOS....:                                              *00070405
      *       DDNAME               I/O                 INCLUDE/BOOK    *00070505
      *----------------------------------------------------------------*00070605
      *     BASE DE DADOS:                                             *00070705
      *       DDNAME               I/O                 INCLUDE/BOOK    *00070805
      *       FOUR001.FUNC          I                    BOOKFUNC       00070905
      *----------------------------------------------------------------*00071005
      *     MODULOS.....:                                              *00071105
      *                                                                *00071205
      *================================================================*00071305
                                                                        00071405
      *================================================================*00071505
       ENVIRONMENT                               DIVISION.              00071605
      *================================================================*00071705
                                                                        00071805
      *----------------------------------------------------------------*00071905
       CONFIGURATION                             SECTION.               00072005
      *----------------------------------------------------------------*00072105
                                                                        00072205
       SPECIAL-NAMES.                                                   00072305
           DECIMAL-POINT                         IS COMMA.              00072405
                                                                        00072505
      *----------------------------------------------------------------*00072605
       INPUT-OUTPUT                              SECTION.               00072705
      *----------------------------------------------------------------*00072805
                                                                        00072905
      *================================================================*00073005
       DATA                                      DIVISION.              00073105
      *================================================================*00073205
                                                                        00073305
      *----------------------------------------------------------------*00073405
       WORKING-STORAGE                           SECTION.               00073505
      *----------------------------------------------------------------*00073605
                                                                        00073705
      *----------------------------------------------------------------*00073705
       01 FILLER                       PIC  X(050)         VALUE        00073705
           '***  FR06CIP2 - INICIO DA AREA DE WORKING   ***'.           00073705
      *----------------------------------------------------------------*00073705
                                                                        00073705
           COPY DFHAID.                                                 00074008

      *----------------------------------------------------------------*00073705
       01 FILLER                       PIC  X(050)         VALUE        00073705
           '***  VARIAVEIS DE APOIO  ***'.                              00073705
      *----------------------------------------------------------------*00073705

       01 WRK-RET                      PIC S9(04) COMP.

       01 WRK-ENTRADA.
          05 WRK-TRANS                 PIC X(04) VALUE SPACES.
          05 WRK-CHAVE                 PIC X(05) VALUE SPACES.
          05 WRK-NOME                  PIC X(30) VALUE SPACES.
          05 WRK-SETOR                 PIC X(04) VALUE SPACES.
          05 WRK-SALARIO               PIC X(10) VALUE SPACES.
          05 WRK-DATAADM               PIC X(10) VALUE SPACES.
          05 WRK-EMAIL                 PIC X(40) VALUE SPACES.
          05 WRK-STATUS                PIC X(01) VALUE SPACES.


      *----------------------------------------------------------------*00075905

           COPY 'B#DADOS'.

      *----------------------------------------------------------------*00075905
                                                                        00076005
      *================================================================*00076105
       PROCEDURE                                 DIVISION.              00076205
      *================================================================*00076305
                                                                        00076405
      ******************************************************************00076511
      *                     PROCESSAMENTO PRINCIPAL                    *00076611
      ******************************************************************00076711
      *----------------------------------------------------------------*00076811
       0000-PRINCIPAL                            SECTION.               00076911
      *----------------------------------------------------------------*00077011
                                                                        00077111
           PERFORM 1000-INICIAR.                                        00077211
                                                                        00077311
           PERFORM 2000-PROCESSAR.                                      00077411
                                                                        00077311
             EXEC CICS SEND                                             00088116
               FROM (WRK-ENTRADA)                                       00088216
               ERASE                                                    00088316
             END-EXEC.                                                  00088516

                                                                        00077511
             EXEC CICS                                                  00088716
               RETURN                                                   00088816
             END-EXEC.                                                  00088916

      *----------------------------------------------------------------*00078005
       0000-99-FIM.                              EXIT.                  00078105
      *----------------------------------------------------------------*00078205
                                                                        00078305
      *----------------------------------------------------------------*00078405
       1000-INICIAR                              SECTION.               00078505
      *----------------------------------------------------------------*00078605
                                                                        00078705
                   INITIALIZE  WRK-ENTRADA WRK-DADOS                    00091012
           EXEC CICS RECEIVE                                            00080305
             INTO(WRK-ENTRADA)                                          00080605
           END-EXEC.                                                    00080705
                                                                        00080805
      *----------------------------------------------------------------*00078605
       1000-99-FIM.                              EXIT.                  00079605
      *----------------------------------------------------------------*00078605

      *----------------------------------------------------------------*00078605
       2000-PROCESSAR                            SECTION.               00080005
      *----------------------------------------------------------------*00078605
                                                                        00080105

              EXEC CICS READ                                            00091012
                 FILE ('FUNC')                                          00091012
                 RIDFLD(WRK-CHAVE OF WRK-ENTRADA)                       00091012
                 INTO(WRK-DADOS)                                        00091012
                 RESP(WRK-RET)                                          00091012
              END-EXEC                                                  00091012
                                                                        00091012
              IF WRK-RET EQUAL DFHRESP(NOTFND)
                MOVE CORR WRK-DADOS TO WRK-ENTRADA
                MOVE 2              TO WRK-STATUS
              ELSE

                MOVE CORR WRK-DADOS TO WRK-ENTRADA
                MOVE 1              TO WRK-STATUS
                 EVALUATE TRUE                                          00091012

                  WHEN                                                  00091012
                       (WRK-SALARIO OF WRK-ENTRADA NOT NUMERIC)OR       00091012
                       (WRK-SALARIO OF WRK-ENTRADA EQUAL ZEROS)         00091012
                       MOVE 3         TO WRK-STATUS                     00091012

                  WHEN                                                  00091012
                       WRK-EMAIL     OF WRK-ENTRADA EQUAL SPACES        00091012
                       MOVE 4        TO WRK-STATUS                      00091012

                                                                        00091012
                                                                        00091812
               END-EVALUATE                                             00091812
                                                                        00091812
               END-IF.
                                                                        00091812
             EXEC CICS SEND                                             00088116
               FROM (WRK-STATUS)                                        00088216
             END-EXEC.                                                  00088516
                                                                        00108615
                                                                        00089012
      *----------------------------------------------------------------*00078605
       2000-99-FIM.                              EXIT.                  00089112
      *----------------------------------------------------------------*00078605
                                                                        00089312

      *----------------------------------------------------------------*00108715
       3000-FINALIZAR                            SECTION.               00108815
      *----------------------------------------------------------------*00108915
                                                                        00108615
                                                                        00108615
      *----------------------------------------------------------------*00109115
       3000-99-FIM.                             EXIT.                   00109215
      *----------------------------------------------------------------*00110012
      *----------------------------------------------------------------*00108715
       9000-TRATAR-ERRO                          SECTION.               00108815
      *----------------------------------------------------------------*00108915
                                                                        00109015
      *----------------------------------------------------------------*00109115
       9000-99-FIM.                             EXIT.                   00109215
      *----------------------------------------------------------------*00110012
