      *================================================================J00001001
       IDENTIFICATION                            DIVISION.              00002001
      *================================================================*00003001
                                                                        00004001
       PROGRAM-ID. F09CIP2.                                             00005004
                                                                        00007001
      *================================================================*00008001
      *                        TREINAMENTO                             *00009001
      *================================================================*00010001
      *     PROGRAMA....: F06CIP2                                      *00020004
      *     AUTOR.......: JOEI LORENTI                                 *00021001
      *     ANALISTA....: IVAN SANCHES                                 *00021101
      *     EMPRESA.....: FOURSYS                                      *00021201
      *     DATA........: 25/06/2022                                   *00021301
      *----------------------------------------------------------------*00021401
      *     OBJETIVO....: PROGRAMA QUE CHAMA QUE CONSULTA OUTRO PGM    *00021505
      *                   CICS                                         *00021605
      *                                                                *00022301
      *                                                                *00022501
      *----------------------------------------------------------------*00023001
      *                                                                *00023101
      *     BASE DE DADOS:         I/O                 INCLUDE/BOOK    *00023201
      *     FOUR001.FUNC            I                     D#FUNC       *00023301
      *                                                                *00023401
      *----------------------------------------------------------------*00023501
      *                                                                *00023601
      *     MODULOS.....:                                              *00023701
      *                                                                *00023901
      *================================================================*00024001
                                                                        00024101
      *================================================================*00024201
       DATA                                      DIVISION.              00024301
      *================================================================*00024401
                                                                        00024501
      *----------------------------------------------------------------*00024601
       WORKING-STORAGE                           SECTION.               00024701
      *----------------------------------------------------------------*00024801
                                                                        00024901
      *----------------------------------------------------------------*00025001
       01  FILLER                      PIC  X(050)         VALUE        00026001
           '*** INICIO DA WORKING FR06CIP2B ***'.                       00027001
      *----------------------------------------------------------------*00028001
                                                                        00029001
      *----------------------------------------------------------------*00030001
       01  FILLER                                  PIC X(050)    VALUE  00040001
           '*** AREA DO MAPA F06CIM1 ***'.                              00041001
      *----------------------------------------------------------------*00042001
                                                                        00043001
           COPY F06CIM1.                                                00044003
                                                                        00045001
      *----------------------------------------------------------------*00046001
       01  FILLER                                  PIC X(050)    VALUE  00047001
           '*** VARIAVEIS AUXILIARES ***'.                              00048001
      *----------------------------------------------------------------*00049001
                                                                        00050001
           COPY 'B#DADOS'.                                              00051005
                                                                        00052705
       77 WRK-EMAIL-NULL                        PIC S9(04) COMP.        00052805
       77 WRK-SQLCODE                           PIC -999.               00052905
       77 WRK-SAIDA                             PIC X(30).              00053205
       77 WRK-RET                      PIC -999.                        00053305
                                                                        00053403
       77 WRK-FLAG                     PIC 9(01).                       00053501
                                                                        00053603
       77 WRK-SAIDA                    PIC X(30).                       00053701
                                                                        00053803
       77 WRK-SALI                     PIC S9(04).                      00053903
                                                                        00054003
      *----------------------------------------------------------------*00054303
       01  FILLER                                  PIC X(050)    VALUE  00054403
           '*** VARIAVEIS DE NULIDADE ***'.                             00054503
      *----------------------------------------------------------------*00054603
                                                                        00054703
                                                                        00054903
      *----------------------------------------------------------------*00055003
       01  FILLER                      PIC X(050)    VALUE              00055103
           '*** AREA DE DB2 ***'.                                       00055203
      *----------------------------------------------------------------*00055303
                                                                        00055403
           EXEC SQL                                                     00055503
             INCLUDE BOOKFUNC                                           00055603
           END-EXEC.                                                    00055703
                                                                        00055803
           EXEC SQL                                                     00055903
             INCLUDE SQLCA                                              00056003
           END-EXEC.                                                    00056103
                                                                        00056203
      *================================================================*00056303
       PROCEDURE                                 DIVISION.              00056403
      *================================================================*00056503
                                                                        00056603
      ******************************************************************00056703
      *                    PROCESSAMENTO PRINCIPAL                     *00056803
      ******************************************************************00056903
      *----------------------------------------------------------------*00057003
       0000-PRINCIPAL                            SECTION.               00057103
      *----------------------------------------------------------------*00057203
                                                                        00057303
                                                                        00058303
            PERFORM 1000-INICIAR.                                       00058405
                                                                        00058505
             IF WRK-FLAG EQUAL 2                                        00058605
              PERFORM 2000-PROCESSAR                                    00058705
             END-IF.                                                    00058805
                                                                        00058905
            PERFORM 3000-FINALIZAR.                                     00059005
                                                                        00059105
           EXEC CICS                                                    00059205
             RETURN TRANSID('TIV3')                                     00059305
           END-EXEC.                                                    00059405
            EXEC CICS                                                   00059503
              RETURN TRANSID('T063')                                    00059605
            END-EXEC.                                                   00059703
                                                                        00059803
      *----------------------------------------------------------------*00059903
       0000-99-FIM.                              EXIT.                  00060003
      *----------------------------------------------------------------*00060103
                                                                        00060203
      *----------------------------------------------------------------*00060303
       1000-INICIAR                              SECTION.               00060403
      *----------------------------------------------------------------*00060503
                                                                        00060603
           EXEC CICS RECEIVE                                            00060703
             MAPSET('F06CIM1')                                          00060803
             MAP('MAPTEST')                                             00060903
             INTO(MAPTESTI)                                             00061003
             RESP(WRK-RET)                                              00061105
           END-EXEC.                                                    00061203
                                                                        00061303
             IF WRK-RET = DFHRESP(MAPFAIL)                              00061405
                MOVE 1 TO WRK-FLAG                                      00061505
             ELSE                                                       00061605
                MOVE 2 TO WRK-FLAG                                      00061705
             END-IF.                                                    00061805
                                                                        00061903
      *----------------------------------------------------------------*00062001
       1000-99-FIM.                              EXIT.                  00062101
      *----------------------------------------------------------------*00062201
                                                                        00062301
      *----------------------------------------------------------------*00062401
       2000-PROCESSAR                            SECTION.               00062501
      *----------------------------------------------------------------*00062601
                                                                        00062705
                                                                        00062801
           IF EIBAID EQUAL '3'                                          00062905
              PERFORM 2100-SAIDA                                        00063005
           END-IF.                                                      00065301
                                                                        00065401
           IF EIBAID EQUAL '6'                                          00065505
              PERFORM 2200-CONSULTA                                     00065605
           END-IF.                                                      00065705
                                                                        00075001
           IF EIBAID EQUAL ''''                                         00076005
              PERFORM 2300-ENTER                                        00077005
           END-IF.                                                      00080005
                                                                        00090005
      *----------------------------------------------------------------*00131501
       2000-99-FIM.                         EXIT.                       00131601
      *----------------------------------------------------------------*00131701
                                                                        00131801
      *----------------------------------------------------------------*00131901
       2100-SAIDA                           SECTION.                    00132005
      *----------------------------------------------------------------*00132101
                                                                        00132201
              MOVE ' ' TO WRK-SAIDA                                     00132305
              EXEC CICS SEND TEXT                                       00132405
               FROM(WRK-SAIDA)                                          00132505
               ERASE                                                    00132605
              END-EXEC                                                  00132705
                                                                        00132805
              EXEC CICS                                                 00132905
                RETURN                                                  00133005
              END-EXEC                                                  00134005
                                                                        00135005
       ----------------------------------------------------------------*00136405
       2100-99-FIM.                         EXIT.                       00136501
      *----------------------------------------------------------------*00136601
                                                                        00136701
      *----------------------------------------------------------------*00136801
       2200-CONSULTA                        SECTION.                    00136901
      *----------------------------------------------------------------*00137001
                                                                        00137101
               MOVE IDI                             TO WRK-CHAVE        00137205
                                                                        00137305
                 EXEC CICS LINK                                         00137405
                  PROGRAM('F06COVSA')                                   00137505
                  COMMAREA(WRK-DADOS)                                   00137605
                  RESP(WRK-RET-CICS)                                    00137705
                 END-EXEC                                               00137805
                                                                        00137905
                  EVALUATE WRK-STATUS                                   00138005
                    WHEN '1'                                            00139005
                      MOVE WRK-CHAVE                    TO IDO          00140005
                      MOVE WRK-NOME                     TO NOMEO        00150005
                      MOVE WRK-SETOR                    TO SETORO       00160005
                      MOVE WRK-SALARIO                  TO SALO         00170005
                      MOVE WRK-DATAADM                  TO DATADMO      00180005
                      MOVE WRK-EMAIL                    TO EMAILO       00190005
                       MOVE 'ENCONTRADO'                TO MSGO         00200005
                    WHEN '2'                                            00210005
                       MOVE 'NAO ENCONTRADO'            TO MSGO         00220005
                                                                        00230005
                    WHEN '3'                                            00240005
                       MOVE 'SALARIO COM ERRO'          TO MSGO         00250005
                                                                        00260005
                    WHEN '4'                                            00270005
                       MOVE 'EMAIL COM ERRO'            TO MSGO         00280005
                  END-EVALUATE                                          00290005
                                                                        00300005
             END-IF.                                                    00310005
                                                                        00311005
                                                                        00319901
      *----------------------------------------------------------------*00320001
       2200-99-FIM.                         EXIT.                       00330001
      *----------------------------------------------------------------*00340001
                                                                        00350001
      *----------------------------------------------------------------*00360001
       2300-ENTER                           SECTION.                    00370005
      *----------------------------------------------------------------*00380001
                                                                        00390001
               MOVE SPACES TO NOMEO SETORO EMAILO DATADMO               00400005
               MOVE ZEROS  TO IDO SALO                                  00410005
               MOVE 'NOVA PESQUISA  ' TO MSGO                           00420005
                                                                        00560001
      *----------------------------------------------------------------*00570001
       2300-99-FIM.                         EXIT.                       00580001
      *----------------------------------------------------------------*00590001
                                                                        00600001
                                                                        01300001
      *----------------------------------------------------------------*01301001
       3000-FINALIZAR                       SECTION.                    01302001
      *----------------------------------------------------------------*01303001
                                                                        01304001
            IF WRK-FLAG EQUAL 1                                         01310001
               EXEC CICS SEND                                           01311001
                MAPSET('F06CIM1')                                       01312001
                MAP('MAPTEST')                                          01313001
                ERASE                                                   01314001
                MAPONLY                                                 01315001
                END-EXEC                                                01316001
            ELSE                                                        01317001
               EXEC CICS SEND                                           01318001
                MAPSET('F06CIM1')                                       01318101
                MAP('MAPTEST')                                          01318201
                DATAONLY                                                01319001
               END-EXEC                                                 01319101
            END-IF.                                                     01319201
                                                                        01319301
                                                                        01319501
      *----------------------------------------------------------------*01320001
       3000-99-FIM.                         EXIT.                       01330001
      *----------------------------------------------------------------*01340001
