      *================================================================*00001000
       IDENTIFICATION                  DIVISION.                        00002043
      *================================================================*00003000
                                                                        00004000
       PROGRAM-ID.  FR06EX01.                                           00005016
                                                                        00006000
      *================================================================*00007000
      *                                                                 00007100
      *     AUTOR.......: JOEI LORENTI                                  00007200
      *     ANALISTA....: IVAN SANCHES                                  00007300
      *     EMPRESA.....: FOURSYS                                       00007400
      *     DATA........: 06/05/2022                                    00007500
      *                                                                 00007600
      *----------------------------------------------------------------*00007700
      *                                                                 00007800
      *     OBJETIVO: LER TODOS OS REGISTROS DO ARQUIVO SEQUENCIAL      00007900
      *               (ARQPECAS) E GERAR UM ARQUIVO SEQUENCIAL DE SAIDA 00008000
      *               (PECACOMP) COM TODAS AS PECAS QUE ESTIVEREM       00008143
      *               ABAIXO DO MINIMO DE ESTOQUE (20) E A RESPECTIVA   00008243
      *               QUANTIDADE A SER COMPRADA.                        00008400
      *                                                                 00008500
      *                                                                 00008600
      *                                                                 00008700
      *----------------------------------------------------------------*00008800
      *                                                                 00008900
      *     INPUT:                                                      00009000
      *     DDNAME           I/O                                        00009100
      *     ARQPECAS          I                                         00009200
      *     PECACOMP          O                                         00009300
      *                                                                 00009400
      *================================================================*00009500
                                                                        00009600
      *================================================================*00009700
       ENVIRONMENT                     DIVISION.                        00009843
      *================================================================*00009900
                                                                        00010000
      *----------------------------------------------------------------*00010100
       CONFIGURATION                   SECTION.                         00010243
      *----------------------------------------------------------------*00010300
                                                                        00010400
       SPECIAL-NAMES.                                                   00010500
           DECIMAL-POINT IS COMMA.                                      00010600
                                                                        00010700
      *----------------------------------------------------------------*00010800
       INPUT-OUTPUT                    SECTION.                         00010943
      *----------------------------------------------------------------*00011000
                                                                        00011100
       FILE-CONTROL.                                                    00011200
             SELECT ARQPECAS           ASSIGN TO JCLPECA                00011317
                FILE STATUS            IS WRK-FS-ARQPECA.               00011400
                                                                        00011502
             SELECT PECACOMP           ASSIGN TO JCLCOMP                00012000
                FILE STATUS            IS WRK-FS-PECACOMP.              00013003
                                                                        00014000
      *================================================================*00015000
       DATA                            DIVISION.                        00016043
      *================================================================*00017000
                                                                        00018000
      *----------------------------------------------------------------*00019000
       FILE                            SECTION.                         00020043
      *----------------------------------------------------------------*00021000
                                                                        00022000
      *----------------------------------------------------------------*00022100
      *                                                                *00022400
      *    INPUT - DADOS DO ARQUIVO DE ENTRADA (ARQPECA) - LRECL = 050 *00022502
      *                                                                *00022600
      *----------------------------------------------------------------*00022700
                                                                        00022800
       FD  ARQPECAS                                                     00023010
            RECORDING MODE IS F                                         00024002
            BLOCK CONTAINS 0 RECORDS.                                   00025002
                                                                        00025107
       01  FD-ARQPECA  PIC X(50).                                       00026002
                                                                        00027000
      *----------------------------------------------------------------*00027100
      *                                                                *00027200
      *    OUTPUT - DADOS DO ARQUIVO DE SAIDA (PECACOMP) - LRECL = 010 *00027302
      *                                                                *00027400
      *----------------------------------------------------------------*00027500
                                                                        00027600
       FD  PECACOMP                                                     00027702
            RECORDING MODE IS F                                         00027802
            BLOCK CONTAINS 0 RECORDS.                                   00027902
                                                                        00028007
       01  FD-PECACOMP PIC X(10).                                       00028102
                                                                        00028200
                                                                        00028300
      *----------------------------------------------------------------*00028400
       WORKING-STORAGE                 SECTION.                         00028543
      *----------------------------------------------------------------*00028600
                                                                        00028700
      *----------------------------------------------------------------*00028800
       01  FILLER                      PIC X(50)    VALUE               00028943
           '***AREA DO AQUIVO ARQPECAS**'.                              00029010
      *----------------------------------------------------------------*00029100
                                                                        00029200
          COPY 'B#ARQPEC'.                                              00029327
                                                                        00029400
      *----------------------------------------------------------------*00030300
       01  FILLER                      PIC X(50)    VALUE               00030428
           '***AREA DO AQUIVO PECACOMP***'.                             00030502
      *----------------------------------------------------------------*00030600
                                                                        00030700
       01 WRK-PECACOMP                 PIC X(10)    VALUE SPACES.       00030800
                                                                        00031200
      *----------------------------------------------------------------*00031300
       01  FILLER                      PIC X(50)               VALUE    00031428
           '**** AREA DE VARIAVEIS DE FILE-STATUS ****'.                00031502
      *----------------------------------------------------------------*00031600
                                                                        00031700
       77 WRK-FS-ARQPECA               PIC X(02)    VALUE SPACES.       00031800
                                                                        00031900
       77 WRK-FS-PECACOMP              PIC X(02)    VALUE SPACES.       00032000
                                                                        00032100
      *----------------------------------------------------------------*00032200
       01  FILLER                      PIC X(50)               VALUE    00032328
           '**** AREA DE AUXILIARES ****'.                              00032402
      *----------------------------------------------------------------*00032500
                                                                        00032600
       77 WRK-QUANT-COMPRA             PIC 9(002)   VALUE ZEROS.        00032745
                                                                        00032828
       77 WRK-MSG                      PIC X(50)    VALUE SPACES.       00032933
                                                                        00033000
       77 WRK-ACU-GRAVADOS             PIC 9(002)   VALUE ZEROS.        00033133
                                                                        00033233
       77 WRK-ACU-LIDOS                PIC 9(002)   VALUE ZEROS.        00033333
                                                                        00033433
      *----------------------------------------------------------------*00033500
       01  FILLER                      PIC X(50)               VALUE    00033628
           '****  AREA DE REDEFINES ****'.                              00033702
      *----------------------------------------------------------------*00033800
                                                                        00033900
      *================================================================*00034000
       PROCEDURE DIVISION.                                              00034100
      *================================================================*00034200
                                                                        00034300
      *----------------------------------------------------------------*00034400
       0000-PRINCIPAL                  SECTION.                         00034543
      *----------------------------------------------------------------*00034600
                                                                        00034700
           PERFORM 1000-INICIAR.                                        00034800
                                                                        00034900
                                                                        00035021
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-ARQPECA EQUAL '10'.      00035100
                                                                        00035200
           PERFORM 3000-FINALIZAR.                                      00035300
                                                                        00035400
                                                                        00035500
           STOP RUN.                                                    00035618
                                                                        00035700
      *----------------------------------------------------------------*00035800
       0000-99-FIM.                    EXIT.                            00035943
      *----------------------------------------------------------------*00036000
                                                                        00036100
      *----------------------------------------------------------------*00036200
       1000-INICIAR                    SECTION.                         00037043
      *----------------------------------------------------------------*00037100
                                                                        00037202
           OPEN INPUT  ARQPECAS                                         00037310
                OUTPUT PECACOMP                                         00037400
                                                                        00037507
           PERFORM 1100-TESTAR-FILE-STATUS.                             00037602
                READ ARQPECAS  INTO WRK-ARQPECA.                        00037710
                                                                        00037800
      *----------------------------------------------------------------*00037900
       1000-99-FIM.            EXIT.                                    00038000
      *----------------------------------------------------------------*00038100
      *----------------------------------------------------------------*00038200
       1100-TESTAR-FILE-STATUS         SECTION.                         00039000
      *----------------------------------------------------------------*00040000
                                                                        00040122
                                                                        00040300
            PERFORM 1110-TESTAR-FILE-STATUS-ARQ.                        00040403
                                                                        00040500
                                                                        00040600
            PERFORM 1120-TESTAR-FILE-STATUS-PECA.                       00040703
                                                                        00040800
      *----------------------------------------------------------------*00040900
       1100-99-FIM.                    EXIT.                            00041000
      *----------------------------------------------------------------*00041100
      *----------------------------------------------------------------*00041200
       1110-TESTAR-FILE-STATUS-ARQ     SECTION.                         00042003
      *----------------------------------------------------------------*00042100
                                                                        00042200
            IF WRK-FS-ARQPECA          NOT EQUAL ZEROS                  00042410
                 MOVE ' ERRO ABERTURA ARQPECAS'                         00042515
                                       TO WRK-MSG                       00042600
                 PERFORM 9000-TRATAR-ERROS                              00042700
            ELSE                                                        00042800
                IF WRK-FS-ARQPECA      NOT EQUAL ZEROS                  00043010
                     DISPLAY ' FIM DE ARQUIVO '                         00043100
                END-IF                                                  00043200
            END-IF.                                                     00043300
                                                                        00043400
      *----------------------------------------------------------------*00043500
       1110-99-FIM.                    EXIT.                            00043600
      *----------------------------------------------------------------*00043700
                                                                        00043800
      *----------------------------------------------------------------*00043900
       1120-TESTAR-FILE-STATUS-PECA    SECTION.                         00044003
      *----------------------------------------------------------------*00044100
                                                                        00044200
            IF WRK-FS-PECACOMP         NOT EQUAL ZEROS                  00044301
                 MOVE ' ERRO ABERTURA PECACOMP '                        00044401
                                       TO WRK-MSG                       00044500
                 PERFORM 9000-TRATAR-ERROS                              00044600
            END-IF.                                                     00045100
                                                                        00045200
      *----------------------------------------------------------------*00045300
       1120-99-FIM.                    EXIT.                            00045400
      *----------------------------------------------------------------*00045500
      *----------------------------------------------------------------*00045600
       2000-PROCESSAR                  SECTION.                         00045700
      *----------------------------------------------------------------*00045800
                                                                        00045920
            MOVE SPACES TO FD-PECACOMP.                                 00046144
            IF WRK-FS-ARQPECA          EQUAL ZEROS                      00046201
                 IF WRK-QUANT-PECA     LESS 20                          00046328
                      COMPUTE WRK-QUANT-COMPRA = (20 - WRK-QUANT-PECA)  00046738
                   MOVE WRK-COD-PECA   TO FD-PECACOMP(01:05)            00046844
                   MOVE WRK-FORN-PECA  TO FD-PECACOMP(06:03)            00046944
                   MOVE WRK-QUANT-COMPRA                                00047042
                                       TO FD-PECACOMP(09:02)            00047144
                                                                        00047938
                   WRITE FD-PECACOMP                                    00048134
                                                                        00048233
                   ADD 1               TO WRK-ACU-GRAVADOS              00048333
                 END-IF                                                 00048428
            END-IF                                                      00048534
                   ADD 1               TO WRK-ACU-LIDOS                 00048634
                                                                        00048728
            READ ARQPECAS              INTO WRK-ARQPECA.                00048843
                                                                        00048900
      *----------------------------------------------------------------*00049000
       2000-99-FIM.                    EXIT.                            00049100
      *----------------------------------------------------------------*00049200
      *----------------------------------------------------------------*00049300
       3000-FINALIZAR                  SECTION.                         00049400
      *----------------------------------------------------------------*00049500
                                                                        00049633
            DISPLAY 'TOTAL LIDOS : '     WRK-ACU-LIDOS                  00049733
            DISPLAY 'TOTAL GRAVADOS : '  WRK-ACU-GRAVADOS               00049833
                                                                        00049933
            CLOSE ARQPECAS                                              00050010
            CLOSE PECACOMP                                              00050108
              IF WRK-FS-ARQPECA        NOT EQUAL ZEROS                  00050243
                MOVE ' STATUS NO CLOSE '                                00050313
                                       TO WRK-MSG                       00050443
                PERFORM 9000-TRATAR-ERROS                               00050513
              END-IF.                                                   00050613
                                                                        00050701
      *----------------------------------------------------------------*00050800
       3000-99-FIM.                    EXIT.                            00050900
      *----------------------------------------------------------------*00051000
                                                                        00051100
      *----------------------------------------------------------------*00051200
       9000-TRATAR-ERROS               SECTION.                         00051300
      *----------------------------------------------------------------*00051400
                                                                        00051500
            DISPLAY '-------------------STATUS-----------------------'. 00051602
            DISPLAY '  MENSAGEM        '  WRK-MSG.                      00051702
            DISPLAY '  FILE STATUS     '  WRK-FS-ARQPECA.               00051802
            DISPLAY '  FILE STATUS     '  WRK-FS-PECACOMP.              00051902
            DISPLAY '------------------------------------------------'. 00052002
                                                                        00052134
           STOP RUN.                                                    00052234
      *---------------------------------------------------------------* 00052313
       9000-99-FIM.                    EXIT.                            00052400
      *----------------------------------------------------------------*00052500
                                                                        00053000
